Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>RXMID1</name>
        <displayName>RXMID1</displayName>
        <description>CAN Each mailbox contains the receive mailbox identifier register 1</description>
        <addressOffset>0x1C0</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RFTXREQ</name>
            <description>RFTXREQ</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IDTYPESEL</name>
            <description>IDTYPESEL</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EXTID</name>
            <description>EXTID</description>
            <bitOffset>3</bitOffset>
            <bitWidth>18</bitWidth>
          </field>
          <field>
            <name>STDID</name>
            <description>STDID</description>
            <bitOffset>21</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TXDLEN0</name>
        <displayName>TXDLEN0</displayName>
        <description>CAN Send the mailbox data length and timestamp register 0</description>
        <addressOffset>0x184</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DLCODE</name>
            <description>DLCODE</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TXDLEN1</name>
        <displayName>TXDLEN1</displayName>
        <description>CAN Send the mailbox data length and timestamp register 1</description>
        <addressOffset>0x194</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DLCODE</name>
            <description>DLCODE</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TXDLEN2</name>
        <displayName>TXDLEN2</displayName>
        <description>CAN Send the mailbox data length and timestamp register 2</description>
        <addressOffset>0x1A4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DLCODE</name>
            <description>DLCODE</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TXMDH0</name>
        <displayName>TXMDH0</displayName>
        <description>CAN Send mailbox High byte data register 0</description>
        <addressOffset>0x18C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DATABYTE4</name>
            <description>DATABYTE4</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE5</name>
            <description>DATABYTE5</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE6</name>
            <description>DATABYTE6</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE7</name>
            <description>DATABYTE7</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TXMDH1</name>
        <displayName>TXMDH1</displayName>
        <description>CAN Send mailbox High byte data register1</description>
        <addressOffset>0x19C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DATABYTE4</name>
            <description>DATABYTE4</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE5</name>
            <description>DATABYTE5</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE6</name>
            <description>DATABYTE6</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE7</name>
            <description>DATABYTE7</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TXMDH2</name>
        <displayName>TXMDH2</displayName>
        <description>CAN Send mailbox High byte data register2</description>
        <addressOffset>0x1AC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DATABYTE4</name>
            <description>DATABYTE4</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE5</name>
            <description>DATABYTE5</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE6</name>
            <description>DATABYTE6</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE7</name>
            <description>DATABYTE7</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TXMDL0</name>
        <displayName>TXMDL0</displayName>
        <description>CAN Send mailbox low byte data register 0</description>
        <addressOffset>0x188</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DATABYTE0</name>
            <description>DATABYTE0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE1</name>
            <description>DATABYTE1</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE2</name>
            <description>DATABYTE2</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE3</name>
            <description>DATABYTE3</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TXMDL1</name>
        <displayName>TXMDL1</displayName>
        <description>CAN Send mailbox low byte data register 1</description>
        <addressOffset>0x198</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DATABYTE0</name>
            <description>DATABYTE0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE1</name>
            <description>DATABYTE1</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE2</name>
            <description>DATABYTE2</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE3</name>
            <description>DATABYTE3</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TXMDL2</name>
        <displayName>TXMDL2</displayName>
        <description>CAN Send mailbox low byte data register 2</description>
        <addressOffset>0x1A8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DATABYTE0</name>
            <description>DATABYTE0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE1</name>
            <description>DATABYTE1</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE2</name>
            <description>DATABYTE2</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATABYTE3</name>
            <description>DATABYTE3</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TXMID0</name>
        <displayName>TXMID0</displayName>
        <description>CAN Each mailbox contains the sending mailbox identifier register 0</description>
        <addressOffset>0x180</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TXMREQ</name>
            <description>TXMREQ</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXRFREQ</name>
            <description>TXRFREQ</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>IDTYPESEL</name>
            <description>IDTYPESEL</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EXTID</name>
            <description>EXTID</description>
            <bitOffset>3</bitOffset>
            <bitWidth>18</bitWidth>
          </field>
          <field>
            <name>STDID</name>
            <description>STDID</description>
            <bitOffset>21</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>TXMID1</name>
        <displayName>TXMID1</displayName>
        <description>CAN Each mailbox contains the sending mailbox identifier register 1</description>
        <addressOffset>0x190</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TXMREQ</name>
            <description>TXMREQ</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXRFREQ</name>
            <description>TXRFREQ</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>IDTYPESEL</name>
            <description>IDTYPESEL</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EXTID</name>
            <description>EXTID</description>
            <bitOffset>3</bitOffset>
            <bitWidth>18</bitWidth>
          </field>
          <field>
            <name>STDID</name>
            <description>STDID</description>
            <bitOffset>21</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>TXMID2</name>
        <displayName>TXMID2</displayName>
        <description>CAN Each mailbox contains the sending mailbox identifier register 2</description>
        <addressOffset>0x1A0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TXMREQ</name>
            <description>TXMREQ</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXRFREQ</name>
            <description>TXRFREQ</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>IDTYPESEL</name>
            <description>IDTYPESEL</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EXTID</name>
            <description>EXTID</description>
            <bitOffset>3</bitOffset>
            <bitWidth>18</bitWidth>
          </field>
          <field>
            <name>STDID</name>
            <description>STDID</description>
            <bitOffset>21</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>TXSTS</name>
        <displayName>TXSTS</displayName>
        <description>CAN Send States register</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>REQCFLG0</name>
            <description>REQCFLG0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXSUSFLG0</name>
            <description>TXSUSFLG0</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ARBLSTFLG0</name>
            <description>ARBLSTFLG0</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXERRFLG0</name>
            <description>TXERRFLG0</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ABREQFLG0</name>
            <description>ABREQFLG0</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>REQCFLG1</name>
            <description>REQCFLG1</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXSUSFLG1</name>
            <description>TXSUSFLG1</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ARBLSTFLG1</name>
            <description>ARBLSTFLG1</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXERRFLG1</name>
            <description>TXERRFLG1</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ABREQFLG1</name>
            <description>ABREQFLG1</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>REQCFLG2</name>
            <description>REQCFLG2</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXSUSFLG2</name>
            <description>TXSUSFLG2</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>ARBLSTFLG2</name>
            <description>ARBLSTFLG2</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXERRFLG2</name>
            <description>TXERRFLG2</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ABREQFLG2</name>
            <description>ABREQFLG2</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EMNUM</name>
            <description>EMNUM</description>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXMEFLG0</name>
            <description>TXMEFLG0</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXMEFLG1</name>
            <description>TXMEFLG1</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXMEFLG2</name>
            <description>TXMEFLG2</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>LOWESTP0</name>
            <description>LOWESTP0</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>LOWESTP1</name>
            <description>LOWESTP1</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>LOWESTP2</name>
            <description>LOWESTP2</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          </fields>
      </register>
