Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CAN2</name>
      <description>Controller area network</description>
      <groupName>CAN</groupName>
      <baseAddress>0x40006800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>CAN2_TX</name>
        <description>CAN2 TX interrupts</description>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>CAN2_RX0</name>
        <description>CAN2 RX0 interrupts</description>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>CAN2_RX1</name>
        <description>CAN2 RX1 interrupts</description>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>CAN2_SCE</name>
        <description>CAN2 SCE interrupt</description>
        <value>66</value>
      </interrupt>
      <registers>
      <register>
        <name>BITTIM</name>
        <displayName>BITTIM</displayName>
        <description>CAN Bit Time register</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>BRPSC</name>
            <description>BRPSC</description>
            <bitOffset>0</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          <field>
            <name>TIMSEG1</name>
            <description>TIMSEG1</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>TIMSEG2</name>
            <description>TIMSEG2</description>
            <bitOffset>20</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        <field>
            <name>RSYNJW</name>
            <description>RSYNJW</description>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>LBKMEN</name>
            <description>LBKMEN</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SILMEN</name>
            <description>SILMEN</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>ERRSTS</name>
        <displayName>ERRSTS</displayName>
        <description>CAN Error States register</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ERRWFLG</name>
            <description>ERRWFLG</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ERRPFLG</name>
            <description>ERRPFLG</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>BOFLG</name>
            <description>BOFLG</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>LERRC</name>
            <description>LERRC</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXERRCNT</name>
            <description>TXERRCNT</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
        <field>
            <name>RXERRCNT</name>
            <description>RXERRCNT</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
          </fields>
      </register>
      <register>
        <name>F0BANK1</name>
        <displayName>F0BANK1</displayName>
        <description>Filter bank 0 register 1</description>
        <addressOffset>0x240</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FBIT0</name>
            <description>Filter bits</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT1</name>
            <description>Filter bits</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT2</name>
            <description>Filter bits</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT3</name>
            <description>Filter bits</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT4</name>
            <description>Filter bits</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT5</name>
            <description>Filter bits</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT6</name>
            <description>Filter bits</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT7</name>
            <description>Filter bits</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT8</name>
            <description>Filter bits</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT9</name>
            <description>Filter bits</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>FBIT10</name>
            <description>Filter bits</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT11</name>
            <description>Filter bits</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT12</name>
            <description>Filter bits</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT13</name>
            <description>Filter bits</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT14</name>
            <description>Filter bits</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT15</name>
            <description>Filter bits</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT16</name>
            <description>Filter bits</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT17</name>
            <description>Filter bits</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT18</name>
            <description>Filter bits</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT19</name>
            <description>Filter bits</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT20</name>
            <description>Filter bits</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT21</name>
            <description>Filter bits</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT22</name>
            <description>Filter bits</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT23</name>
            <description>Filter bits</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT24</name>
            <description>Filter bits</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT25</name>
            <description>Filter bits</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT26</name>
            <description>Filter bits</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT27</name>
            <description>Filter bits</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT28</name>
            <description>Filter bits</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT29</name>
            <description>Filter bits</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT30</name>
            <description>Filter bits</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT31</name>
            <description>Filter bits</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>F0BANK2</name>
        <displayName>F0BANK2</displayName>
        <description>Filter bank 0 register 2</description>
        <addressOffset>0x244</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FBIT0</name>
            <description>Filter bits</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT1</name>
            <description>Filter bits</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT2</name>
            <description>Filter bits</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT3</name>
            <description>Filter bits</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT4</name>
            <description>Filter bits</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT5</name>
            <description>Filter bits</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT6</name>
            <description>Filter bits</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT7</name>
            <description>Filter bits</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT8</name>
            <description>Filter bits</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT9</name>
            <description>Filter bits</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>FBIT10</name>
            <description>Filter bits</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT11</name>
            <description>Filter bits</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT12</name>
            <description>Filter bits</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT13</name>
            <description>Filter bits</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT14</name>
            <description>Filter bits</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT15</name>
            <description>Filter bits</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT16</name>
            <description>Filter bits</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT17</name>
            <description>Filter bits</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT18</name>
            <description>Filter bits</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT19</name>
            <description>Filter bits</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT20</name>
            <description>Filter bits</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT21</name>
            <description>Filter bits</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT22</name>
            <description>Filter bits</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT23</name>
            <description>Filter bits</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT24</name>
            <description>Filter bits</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT25</name>
            <description>Filter bits</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT26</name>
            <description>Filter bits</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT27</name>
            <description>Filter bits</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT28</name>
            <description>Filter bits</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT29</name>
            <description>Filter bits</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT30</name>
            <description>Filter bits</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FBIT31</name>
            <description>Filter bits</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
