Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DBGMCU</name>
      <description>Debug support</description>
      <groupName>DBGMCU</groupName>
      <baseAddress>0xE0042000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>APB1F</name>
        <displayName>APB1F</displayName>
        <description>Debug MCU APB1 Freeze registe</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TMR2_STS</name>
            <description>TMR2 counter stopped when core is halted</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR3_STS</name>
            <description>TMR3 counter stopped when core is halted</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR4_STS</name>
            <description>TMR4 counter stopped when core is halted</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR5_STS</name>
            <description>TMR5 counter stopped when core is halted</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR12_STS</name>
            <description>TMR12 counter stopped when core is halted</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR13_STS</name>
            <description>TMR13 counter stopped when core is halted</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR14_STS</name>
            <description>TMR14 counter stopped when core is halted</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTC_STS</name>
            <description>RTC counter stopped when core is halted</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WWDT_STS</name>
            <description>WWDT counter stopped when core is halted</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>IWDT_STS</name>
            <description>IWDT counter stopped when core is halted</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>I2C1_SMBUS_TIMEOUT_STS</name>
            <description>I2C1_SMBUS_TIMEOUT_STS</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>I2C2_SMBUS_TIMEOUT_STS</name>
            <description>I2C2_SMBUS_TIMEOUT_STS</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>I2C3_SMBUS_TIMEOUT_STS</name>
            <description>I2C3_SMBUS_TIMEOUT_STS</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CAN1_STS</name>
            <description>CAN1 counter stopped when core is halted</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CAN2_STS</name>
            <description>CAN2 counter stopped when core is halted</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>APB2F</name>
        <displayName>APB2F</displayName>
        <description>Debug MCU APB2 Freeze registe</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TMR1_STS</name>
            <description>TMR1 counter stopped when core is halted</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR8_STS</name>
            <description>TMR8 counter stopped when core is halted</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR9_STS</name>
            <description>TMR9 counter stopped when core is halted</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>TMR10_STS</name>
            <description>TMR10 counter stopped when core is halted</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR11_STS</name>
            <description>TMR11 counter stopped when core is halted</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CFG</name>
        <displayName>CFG</displayName>
        <description>Control Register</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SLEEP_CLK_STS</name>
            <description>Configure clock status when MCU is debugged in sleep mode</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STOP_CLK_STS</name>
            <description>Configure clock status when MCU is debugged in stop mode</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STANDBY_CLK_STS</name>
            <description>Configure clock status when MCU is debugged in standby mode</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRACE_IOEN</name>
            <description>Trace Debug Pin Enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRACE_MODE</name>
            <description>Trace Debug Pin Mode Configure</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IDCODE</name>
        <displayName>IDCODE</displayName>
        <description>IDCODE</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x10006411</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>EQR</name>
            <description>Equipment Recognition</description>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
          <field>
            <name>WVR</name>
            <description>Wafer Version Recognition</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
