Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA2</name>
      <description>DMA controller</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40026400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>DMA2_STR0</name>
        <description>DMA2 Stream 0 global interrupt</description>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR1</name>
        <description>DMA2 Stream 1 global interrupt</description>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR2</name>
        <description>DMA2 Stream 2 global interrupt</description>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR3</name>
        <description>DMA2 Stream 3 global interrupt</description>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR4</name>
        <description>DMA2 Stream 4 global interrupt</description>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR5</name>
        <description>DMA2 Stream 5 global interrupt</description>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR6</name>
        <description>DMA2 Stream 6 global interrupt</description>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>DMA2_STR7</name>
        <description>DMA2 Stream 7 global interrupt</description>
        <value>70</value>
      </interrupt>
      <registers>
      <register>
        <name>FCTRL0</name>
        <displayName>FCTRL0</displayName>
        <description>stream x FIFO control register</description>
        <addressOffset>0x24</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x21</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FTHSEL</name>
            <description>FIFO threshold selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>DMDEN</name>
            <description>Direct mode disable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FSTS</name>
            <description>FIFO status</description>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FEIEN</name>
            <description>FIFO error interrupt enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>FCTRL1</name>
        <displayName>FCTRL1</displayName>
        <description>stream x FIFO control register</description>
        <addressOffset>0x3C</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x21</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FTHSEL</name>
            <description>FIFO threshold selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>DMDEN</name>
            <description>Direct mode disable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FSTS</name>
            <description>FIFO status</description>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FEIEN</name>
            <description>FIFO error interrupt enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>FCTRL2</name>
        <displayName>FCTRL2</displayName>
        <description>stream x FIFO control register</description>
        <addressOffset>0x54</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x21</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FTHSEL</name>
            <description>FIFO threshold selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>DMDEN</name>
            <description>Direct mode disable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FSTS</name>
            <description>FIFO status</description>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FEIEN</name>
            <description>FIFO error interrupt enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>FCTRL3</name>
        <displayName>FCTRL3</displayName>
        <description>stream x FIFO control register</description>
        <addressOffset>0x6C</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x21</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FTHSEL</name>
            <description>FIFO threshold selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>DMDEN</name>
            <description>Direct mode disable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FSTS</name>
            <description>FIFO status</description>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FEIEN</name>
            <description>FIFO error interrupt enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>FCTRL4</name>
        <displayName>FCTRL4</displayName>
        <description>stream x FIFO control register</description>
        <addressOffset>0x84</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x21</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FTHSEL</name>
            <description>FIFO threshold selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>DMDEN</name>
            <description>Direct mode disable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FSTS</name>
            <description>FIFO status</description>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FEIEN</name>
            <description>FIFO error interrupt enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>FCTRL5</name>
        <displayName>FCTRL5</displayName>
        <description>stream x FIFO control register</description>
        <addressOffset>0x9C</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x21</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FTHSEL</name>
            <description>FIFO threshold selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>DMDEN</name>
            <description>Direct mode disable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FSTS</name>
            <description>FIFO status</description>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FEIEN</name>
            <description>FIFO error interrupt enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>FCTRL6</name>
        <displayName>FCTRL6</displayName>
        <description>stream x FIFO control register</description>
        <addressOffset>0xB4</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x21</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FTHSEL</name>
            <description>FIFO threshold selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>DMDEN</name>
            <description>Direct mode disable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FSTS</name>
            <description>FIFO status</description>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FEIEN</name>
            <description>FIFO error interrupt enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>FCTRL7</name>
        <displayName>FCTRL7</displayName>
        <description>stream x FIFO control register</description>
        <addressOffset>0xCC</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x21</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FTHSEL</name>
            <description>FIFO threshold selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>DMDEN</name>
            <description>Direct mode disable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FSTS</name>
            <description>FIFO status</description>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FEIEN</name>
            <description>FIFO error interrupt enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>HIFCLR</name>
        <displayName>HIFCLR</displayName>
        <description>high interrupt flag clear register</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CFEIFLG4</name>
            <description>Stream x clear FIFO error interrupt flag (x = 7..4)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CDMEIFLG4</name>
            <description>Stream x clear direct mode error interrupt flag (x = 7..4)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXEIFLG4</name>
            <description>Stream x clear transfer error interrupt flag (x = 7..4)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHTXIFLG4</name>
            <description>Stream x clear half transfer interrupt flag (x = 7..4)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXCIFLG4</name>
            <description>Stream x clear transfer complete interrupt flag (x = 7..4)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CFEIFLG5</name>
            <description>Stream x clear FIFO error interrupt flag (x = 7..4)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CDMEIFLG5</name>
            <description>Stream x clear direct mode error interrupt flag (x = 7..4)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXEIFLG5</name>
            <description>Stream x clear transfer error interrupt flag (x = 7..4)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHTXIFLG5</name>
            <description>Stream x clear half transfer interrupt flag (x = 7..4)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXCIFLG5</name>
            <description>Stream x clear transfer complete interrupt flag (x = 7..4)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CFEIFLG6</name>
            <description>Stream x clear FIFO error interrupt flag (x = 7..4)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CDMEIFLG6</name>
            <description>Stream x clear direct mode error interrupt flag (x = 7..4)</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXEIFLG6</name>
            <description>Stream x clear transfer error interrupt flag (x = 7..4)</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHTXIFLG6</name>
            <description>Stream x clear half transfer interrupt flag (x = 7..4)</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXCIFLG6</name>
            <description>Stream x clear transfer complete interrupt flag (x = 7..4)</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CFEIFLG7</name>
            <description>Stream x clear FIFO error interrupt flag (x = 7..4)</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CDMEIFLG7</name>
            <description>Stream x clear direct mode error interrupt flag (x = 7..4)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXEIFLG7</name>
            <description>Stream x clear transfer error interrupt flag (x = 7..4)</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CHTXIFLG7</name>
            <description>Stream x clear half transfer interrupt flag (x = 7..4)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXCIFLG7</name>
            <description>Stream x clear transfer complete interrupt flag (x = 7..4)</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HINTSTS</name>
        <displayName>HINTSTS</displayName>
        <description>high interrupt status register</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FEIFLG4</name>
            <description>Stream x FIFO error interrupt flag (x=7..4)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMEIFLG4</name>
            <description>Stream x direct mode error interrupt flag (x=7..4)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXEIFLG4</name>
            <description>Stream x transfer error interrupt flag (x=7..4)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTXIFLG4</name>
            <description>Stream x half transfer interrupt flag (x=7..4)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXCIFLG4</name>
            <description>Stream x transfer complete interrupt flag (x=7..4)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FEIFLG5</name>
            <description>Stream x FIFO error interrupt flag (x=7..4)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMEIFLG5</name>
            <description>Stream x direct mode error interrupt flag (x=7..4)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXEIFLG5</name>
            <description>Stream x transfer error interrupt flag (x=7..4)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTXIFLG5</name>
            <description>Stream x half transfer interrupt flag (x=7..4)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXCIFLG5</name>
            <description>Stream x transfer complete interrupt flag (x=7..4)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FEIFLG6</name>
            <description>Stream x FIFO error interrupt flag (x=7..4)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMEIFLG6</name>
            <description>Stream x direct mode error interrupt flag (x=7..4)</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXEIFLG6</name>
            <description>Stream x transfer error interrupt flag (x=7..4)</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTXIFLG6</name>
            <description>Stream x half transfer interrupt flag (x=7..4)</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXCIFLG6</name>
            <description>Stream x transfer complete interrupt flag (x=7..4)</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FEIFLG7</name>
            <description>Stream x FIFO error interrupt flag (x=7..4)</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMEIFLG7</name>
            <description>Stream x direct mode error interrupt flag (x=7..4)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXEIFLG7</name>
            <description>Stream x transfer error interrupt flag (x=7..4)</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>HTXIFLG7</name>
            <description>Stream x half transfer interrupt flag (x=7..4)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXCIFLG7</name>
            <description>Stream x transfer complete interrupt flag (x=7..4)</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
