Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>LIFCLR</name>
        <displayName>LIFCLR</displayName>
        <description>low interrupt flag clear register</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CFEIFLG0</name>
            <description>Stream x clear FIFO error interrupt flag (x = 3..0)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CDMEIFLG0</name>
            <description>Stream x clear direct mode error interrupt flag (x = 3..0)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXEIFLG0</name>
            <description>Stream x clear transfer error interrupt flag(x = 3..0)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHTXIFLG0</name>
            <description>Stream x clear half transfer interrupt flag (x = 3..0)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXCIFLG0</name>
            <description>Stream x clear transfer complete interrupt flag (x = 3..0)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CFEIFLG1</name>
            <description>Stream x clear FIFO error interrupt flag (x = 3..0)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CDMEIFLG1</name>
            <description>Stream x clear direct mode error interrupt flag (x = 3..0)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXEIFLG1</name>
            <description>Stream x clear transfer error interrupt flag (x = 3..0)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHTXIFLG1</name>
            <description>Stream x clear half transfer interrupt flag (x = 3..0)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXCIFLG1</name>
            <description>Stream x clear transfer complete interrupt flag (x = 3..0)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CFEIFLG2</name>
            <description>Stream x clear FIFO error interrupt flag (x = 3..0)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CDMEIFLG2</name>
            <description>Stream x clear direct mode error interrupt flag (x = 3..0)</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXEIFLG2</name>
            <description>Stream x clear transfer error interrupt
 flag(x = 3..0)</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHTXIFLG2</name>
            <description>Stream x clear half transfer interrupt flag (x = 3..0)</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXCIFLG2</name>
            <description>Stream x clear transfer complete interrupt flag (x = 3..0)</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CFEIFLG3</name>
            <description>Stream x clear FIFO error interrupt
 flag (x = 3..0)</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CDMEIFLG3</name>
            <description>Stream x clear direct mode error interrupt flag (x = 3..0)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXEIFLG3</name>
            <description>Stream x clear transfer error interrupt
 flag(x = 3..0)</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CHTXIFLG3</name>
            <description>Stream x clear half transfer interrupt flag (x = 3..0)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTXCIFLG3</name>
            <description>Stream x clear transfer complete interrupt flag (x = 3..0)</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>LINTSTS</name>
        <displayName>LINTSTS</displayName>
        <description>low interrupt status register</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FEIFLG0</name>
            <description>Stream x FIFO error interrupt flag (x=3..0)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMEIFLG0</name>
            <description>Stream x direct mode error interrupt flag (x=3..0)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXEIFLG0</name>
            <description>Stream x transfer error interrupt flag (x=3..0)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTXIFLG0</name>
            <description>Stream x half transfer interrupt flag (x=3..0)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXCIFLG0</name>
            <description>Stream x transfer complete interrupt flag (x = 3..0)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FEIFLG1</name>
            <description>Stream x FIFO error interrupt flag (x=3..0)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMEIFLG1</name>
            <description>Stream x direct mode error interrupt flag (x=3..0)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXEIFLG1</name>
            <description>Stream x transfer error interrupt flag (x=3..0)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTXIFLG1</name>
            <description>Stream x half transfer interrupt flag (x=3..0)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXCIFLG1</name>
            <description>Stream x transfer complete interrupt flag (x = 3..0)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FEIFLG2</name>
            <description>Stream x FIFO error interrupt flag (x=3..0)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMEIFLG2</name>
            <description>Stream x direct mode error interrupt flag (x=3..0)</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXEIFLG2</name>
            <description>Stream x transfer error interrupt flag (x=3..0)</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HTXIFLG2</name>
            <description>Stream x half transfer interrupt flag (x=3..0)</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXCIFLG2</name>
            <description>Stream x transfer complete interrupt flag (x = 3..0)</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FEIFLG3</name>
            <description>Stream x FIFO error interrupt flag (x=3..0)</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMEIFLG3</name>
            <description>Stream x direct mode error interrupt flag (x=3..0)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXEIFLG3</name>
            <description>Stream x transfer error interrupt flag (x=3..0)</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>HTXIFLG3</name>
            <description>Stream x half transfer interrupt flag (x=3..0)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXCIFLG3</name>
            <description>Stream x transfer complete interrupt flag (x = 3..0)</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>M0ADDR0</name>
        <displayName>M0ADDR0</displayName>
        <description>stream x memory 0 address register</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M0ADDR</name>
            <description>Memory 0 address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M0ADDR1</name>
        <displayName>M0ADDR1</displayName>
        <description>stream x memory 0 address register</description>
        <addressOffset>0x34</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M0ADDR</name>
            <description>Memory 0 address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M0ADDR2</name>
        <displayName>M0ADDR2</displayName>
        <description>stream x memory 0 address register</description>
        <addressOffset>0x4C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M0ADDR</name>
            <description>Memory 0 address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M0ADDR3</name>
        <displayName>M0ADDR3</displayName>
        <description>stream x memory 0 address register</description>
        <addressOffset>0x64</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M0ADDR</name>
            <description>Memory 0 address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M0ADDR4</name>
        <displayName>M0ADDR4</displayName>
        <description>stream x memory 0 address register</description>
        <addressOffset>0x7C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M0ADDR</name>
            <description>Memory 0 address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M0ADDR6</name>
        <displayName>M0ADDR6</displayName>
        <description>stream x memory 0 address register</description>
        <addressOffset>0xAC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M0ADDR</name>
            <description>Memory 0 address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M0ADDR7</name>
        <displayName>M0ADDR7</displayName>
        <description>stream x memory 0 address register</description>
        <addressOffset>0xC4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M0ADDR</name>
            <description>Memory 0 address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M1ADDR0</name>
        <displayName>M1ADDR0</displayName>
        <description>stream x memory 1 address register</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M1ADDR</name>
            <description>Memory 1 address (used in case of Double buffer mode)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M1ADDR1</name>
        <displayName>M1ADDR1</displayName>
        <description>stream x memory 1 address register</description>
        <addressOffset>0x38</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M1ADDR</name>
            <description>Memory 1 address (used in case of Double buffer mode)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M1ADDR2</name>
        <displayName>M1ADDR2</displayName>
        <description>stream x memory 1 address register</description>
        <addressOffset>0x50</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M1ADDR</name>
            <description>Memory 1 address (used in case of Double buffer mode)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M1ADDR3</name>
        <displayName>M1ADDR3</displayName>
        <description>stream x memory 1 address register</description>
        <addressOffset>0x68</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M1ADDR</name>
            <description>Memory 1 address (used in case of Double buffer mode)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M1ADDR4</name>
        <displayName>M1ADDR4</displayName>
        <description>stream x memory 1 address register</description>
        <addressOffset>0x80</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M1ADDR</name>
            <description>Memory 1 address (used in case of Double buffer mode)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M1ADDR5</name>
        <displayName>M1ADDR5</displayName>
        <description>stream x memory 0 address register</description>
        <addressOffset>0x94</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M0ADDR</name>
            <description>Memory 0 address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M1ADDR6</name>
        <displayName>M1ADDR6</displayName>
        <description>stream x memory 1 address register</description>
        <addressOffset>0xB0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M1ADDR</name>
            <description>Memory 1 address (used in case of Double buffer mode)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>M1ADDR7</name>
        <displayName>M1ADDR7</displayName>
        <description>stream x memory 1 address register</description>
        <addressOffset>0xC8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M1ADDR</name>
            <description>Memory 1 address (used in case of Double buffer mode)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>NDATA0</name>
        <displayName>NDATA0</displayName>
        <description>stream x number of data register</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>NDATA</name>
            <description>Number of data items to transfer</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>NDATA1</name>
        <displayName>NDATA1</displayName>
        <description>stream x number of data register</description>
        <addressOffset>0x2C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>NDATA</name>
            <description>Number of data items to transfer</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>NDATA2</name>
        <displayName>NDATA2</displayName>
        <description>stream x number of data register</description>
        <addressOffset>0x44</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>NDATA</name>
            <description>Number of data items to transfer</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>NDATA3</name>
        <displayName>NDATA3</displayName>
        <description>stream x number of data register</description>
        <addressOffset>0x5C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>NDATA</name>
            <description>Number of data items to transfer</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>NDATA4</name>
        <displayName>NDATA4</displayName>
        <description>stream x number of data register</description>
        <addressOffset>0x74</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>NDATA</name>
            <description>Number of data items to transfer</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>NDATA5</name>
        <displayName>NDATA5</displayName>
        <description>stream x number of data register</description>
        <addressOffset>0x8C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>NDATA</name>
            <description>Number of data items to transfer</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
