Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>NDATA6</name>
        <displayName>NDATA6</displayName>
        <description>stream x number of data register</description>
        <addressOffset>0xA4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>NDATA</name>
            <description>Number of data items to transfer</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>NDATA7</name>
        <displayName>NDATA7</displayName>
        <description>stream x number of data register</description>
        <addressOffset>0xBC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>NDATA</name>
            <description>Number of data items to transfer</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PADDR0</name>
        <displayName>PADDR0</displayName>
        <description>stream x peripheral address register</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PADDR</name>
            <description>Peripheral address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PADDR1</name>
        <displayName>PADDR1</displayName>
        <description>stream x peripheral address register</description>
        <addressOffset>0x30</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PADDR</name>
            <description>Peripheral address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PADDR2</name>
        <displayName>PADDR2</displayName>
        <description>stream x peripheral address register</description>
        <addressOffset>0x48</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PADDR</name>
            <description>Peripheral address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PADDR3</name>
        <displayName>PADDR3</displayName>
        <description>stream x peripheral address register</description>
        <addressOffset>0x60</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PADDR</name>
            <description>Peripheral address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PADDR4</name>
        <displayName>PADDR4</displayName>
        <description>stream x peripheral address register</description>
        <addressOffset>0x78</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PADDR</name>
            <description>Peripheral address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PADDR5</name>
        <displayName>PADDR5</displayName>
        <description>stream x peripheral address register</description>
        <addressOffset>0x90</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PADDR</name>
            <description>Peripheral address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PADDR6</name>
        <displayName>PADDR6</displayName>
        <description>stream x peripheral address register</description>
        <addressOffset>0xA8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PADDR</name>
            <description>Peripheral address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PADDR7</name>
        <displayName>PADDR7</displayName>
        <description>stream x peripheral address register</description>
        <addressOffset>0xC0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PADDR</name>
            <description>Peripheral address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>S5M1AR</name>
        <displayName>S5M1AR</displayName>
        <description>stream x memory 1 address register</description>
        <addressOffset>0x98</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>M1ADDR</name>
            <description>Memory 1 address (used in case of Double buffer mode)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SCFG0</name>
        <displayName>SCFG0</displayName>
        <description>stream x configuration register</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>EN</name>
            <description>Stream enable / flag stream ready when read low</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMEIEN</name>
            <description>Direct mode error interrupt enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXEIEN</name>
            <description>Transfer error interrupt enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>HTXIEN</name>
            <description>Half transfer interrupt enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXCIEN</name>
            <description>Transfer complete interrupt enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PERFC</name>
            <description>Peripheral flow controller</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DIRCFG</name>
            <description>Data transfer direction</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CIRCMEN</name>
            <description>Circular mode</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PERIM</name>
            <description>Peripheral increment mode</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MEMIM</name>
            <description>Memory increment mode</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PERSIZECFG</name>
            <description>Peripheral data size</description>
            <bitOffset>11</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MEMSIZECFG</name>
            <description>Memory data size</description>
            <bitOffset>13</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PERIOSIZE</name>
            <description>Peripheral increment offset size</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PRILCFG</name>
            <description>Priority level</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DBM</name>
            <description>Double buffer mode</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTARG</name>
            <description>Current target (only in double buffer mode)</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PBCFG</name>
            <description>Peripheral burst transfer configuration</description>
            <bitOffset>21</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MBCFG</name>
            <description>Memory burst transfer configuration</description>
            <bitOffset>23</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CHSEL</name>
            <description>Channel selection</description>
            <bitOffset>25</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>SCFG1</name>
        <displayName>SCFG1</displayName>
        <description>stream x configuration register</description>
        <addressOffset>0x28</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>EN</name>
            <description>Stream enable / flag stream ready when read low</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMEIEN</name>
            <description>Direct mode error interrupt enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXEIEN</name>
            <description>Transfer error interrupt enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>HTXIEN</name>
            <description>Half transfer interrupt enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXCIEN</name>
            <description>Transfer complete interrupt enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PERFC</name>
            <description>Peripheral flow controller</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DIRCFG</name>
            <description>Data transfer direction</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CIRCMEN</name>
            <description>Circular mode</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PERIM</name>
            <description>Peripheral increment mode</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MEMIM</name>
            <description>Memory increment mode</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PERSIZECFG</name>
            <description>Peripheral data size</description>
            <bitOffset>11</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MEMSIZECFG</name>
            <description>Memory data size</description>
            <bitOffset>13</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PERIOSIZE</name>
            <description>Peripheral increment offset size</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PRILCFG</name>
            <description>Priority level</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DBM</name>
            <description>Double buffer mode</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTARG</name>
            <description>Current target (only in double buffer mode)</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ACK</name>
            <description>ACK</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PBCFG</name>
            <description>Peripheral burst transfer configuration</description>
            <bitOffset>21</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MBCFG</name>
            <description>Memory burst transfer configuration</description>
            <bitOffset>23</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CHSEL</name>
            <description>Channel selection</description>
            <bitOffset>25</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>SCFG2</name>
        <displayName>SCFG2</displayName>
        <description>stream x configuration register</description>
        <addressOffset>0x40</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>EN</name>
            <description>Stream enable / flag stream ready when read low</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMEIEN</name>
            <description>Direct mode error interrupt enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXEIEN</name>
            <description>Transfer error interrupt enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>HTXIEN</name>
            <description>Half transfer interrupt enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXCIEN</name>
            <description>Transfer complete interrupt enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PERFC</name>
            <description>Peripheral flow controller</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DIRCFG</name>
            <description>Data transfer direction</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CIRCMEN</name>
            <description>Circular mode</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PERIM</name>
            <description>Peripheral increment mode</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MEMIM</name>
            <description>Memory increment mode</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PERSIZECFG</name>
            <description>Peripheral data size</description>
            <bitOffset>11</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MEMSIZECFG</name>
            <description>Memory data size</description>
            <bitOffset>13</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PERIOSIZE</name>
            <description>Peripheral increment offset size</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PRILCFG</name>
            <description>Priority level</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DBM</name>
            <description>Double buffer mode</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTARG</name>
            <description>Current target (only in double buffer mode)</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ACK</name>
            <description>ACK</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PBCFG</name>
            <description>Peripheral burst transfer configuration</description>
            <bitOffset>21</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MBCFG</name>
            <description>Memory burst transfer configuration</description>
            <bitOffset>23</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CHSEL</name>
            <description>Channel selection</description>
            <bitOffset>25</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          </fields>
      </register>
