Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>RTEN</name>
        <displayName>RTEN</displayName>
        <description>Rising Trigger selection register</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RTEN0</name>
            <description>Rising trigger event configuration of line 0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN1</name>
            <description>Rising trigger event configuration of line 1</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN2</name>
            <description>Rising trigger event configuration of line 2</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN3</name>
            <description>Rising trigger event configuration of line 3</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN4</name>
            <description>Rising trigger event configuration of line 4</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN5</name>
            <description>Rising trigger event configuration of line 5</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN6</name>
            <description>Rising trigger event configuration of line 6</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN7</name>
            <description>Rising trigger event configuration of line 7</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN8</name>
            <description>Rising trigger event configuration of line 8</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN9</name>
            <description>Rising trigger event configuration of line 9</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>RTEN10</name>
            <description>Rising trigger event configuration of line 10</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN11</name>
            <description>Rising trigger event configuration of line 11</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN12</name>
            <description>Rising trigger event configuration of line 12</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN13</name>
            <description>Rising trigger event configuration of line 13</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN14</name>
            <description>Rising trigger event configuration of line 14</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN15</name>
            <description>Rising trigger event configuration of line 15</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN16</name>
            <description>Rising trigger event configuration of line 16</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN17</name>
            <description>Rising trigger event configuration of line 17</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN18</name>
            <description>Rising trigger event configuration of line 18</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN21</name>
            <description>Rising trigger event configuration of line 21</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTEN22</name>
            <description>Rising trigger event configuration of line 22</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>SWINTE</name>
        <displayName>SWINTE</displayName>
        <description>Software interrupt event register</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SWINTE0</name>
            <description>Software Interrupt on line 0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE1</name>
            <description>Software Interrupt on line 1</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE2</name>
            <description>Software Interrupt on line 2</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE3</name>
            <description>Software Interrupt on line 3</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE4</name>
            <description>Software Interrupt on line 4</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE5</name>
            <description>Software Interrupt on line 5</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE6</name>
            <description>Software Interrupt on line 6</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE7</name>
            <description>Software Interrupt on line 7</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE8</name>
            <description>Software Interrupt on line 8</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE9</name>
            <description>Software Interrupt on line 9</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>SWINTE10</name>
            <description>Software Interrupt on line 10</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE11</name>
            <description>Software Interrupt on line 11</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE12</name>
            <description>Software Interrupt on line 12</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE13</name>
            <description>Software Interrupt on line 13</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE14</name>
            <description>Software Interrupt on line 14</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE15</name>
            <description>Software Interrupt on line 15</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE16</name>
            <description>Software Interrupt on line 16</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE17</name>
            <description>Software Interrupt on line 17</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE18</name>
            <description>Software Interrupt on line 18</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE21</name>
            <description>Software Interrupt on line 21</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWINTE22</name>
            <description>Software Interrupt on line 22</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
