Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FMC</name>
      <description>Flash memory controller</description>
      <groupName>FMC</groupName>
      <baseAddress>0x40023C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>FLASH</name>
        <description>Flash global interrupt</description>
        <value>4</value>
      </interrupt>
      <registers>
      <register>
        <name>ACCTRL</name>
        <displayName>ACCTRL</displayName>
        <description>Flash access control register</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>WAITP</name>
            <description>Wait Period</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>PREFEN</name>
            <description>Prefetch enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ICACHEEN</name>
            <description>Instruction cache enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DCACHEEN</name>
            <description>Data cache enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ICACHERST</name>
            <description>Instruction cache reset</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>DCACHERST</name>
            <description>Data cache reset</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>CTRL</name>
        <displayName>CTRL</displayName>
        <description>Control register</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x80000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PG</name>
            <description>Programming</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SERS</name>
            <description>Sector Erase</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MERS</name>
            <description>Mass Erase</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SNUM</name>
            <description>Sector number</description>
            <bitOffset>3</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>PGSIZE</name>
            <description>Program size</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>START</name>
            <description>Start</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>OPCINTEN</name>
            <description>End of operation interrupt enable</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ERRINTEN</name>
            <description>Error interrupt enable</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <description>Lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>KEY</name>
        <displayName>KEY</displayName>
        <description>Flash key register</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>write-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>KEY</name>
            <description>key</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OPTCTRL</name>
        <displayName>OPTCTRL</displayName>
        <description>Flash option control register</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFFFAAED</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>OPTLOCK</name>
            <description>Option lock</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OPTSTART</name>
            <description>Option start</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BORLVL</name>
            <description>Brownout reset Level</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>WDTSEL</name>
            <description>Watchdog Select</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>RSTSTOP</name>
            <description>nRST_STOP User option mode</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RSTSTDB</name>
            <description>nReset in STANDBY Mode</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RPROT</name>
            <description>Read protect</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>NWPROT</name>
            <description>Not write protect</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>PCROPEN</name>
            <description>PCROP Enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>OPTKEY</name>
        <displayName>OPTKEY</displayName>
        <description>Flash option key register</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>write-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>OPTKEY</name>
            <description>Option byte key</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>STS</name>
        <displayName>STS</displayName>
        <description>Status register</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>OPRCMP</name>
            <description>End of operation</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OPRERR</name>
            <description>Operation error</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WPROTERR</name>
            <description>Write protection error</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>PGALGERR</name>
            <description>Programming alignment error</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PGPRLERR</name>
            <description>Programming parallelism error</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PGSEQERR</name>
            <description>Programming sequence error</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BUSY</name>
            <description>Busy</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          </fields>
      </register>
