Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>ODATA</name>
        <displayName>ODATA</displayName>
        <description>GPIO port output data register</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ODATA0</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA1</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA2</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA3</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA4</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA5</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA6</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA7</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA8</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA9</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>ODATA10</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA11</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA12</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA13</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA14</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ODATA15</name>
            <description>Port output data (y = 0..15)</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>OMODE</name>
        <displayName>OMODE</displayName>
        <description>GPIO port output type register</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>OMODE0</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE1</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE2</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE3</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE4</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE5</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE6</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE7</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE8</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE9</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>OMODE10</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE11</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE12</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE13</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE14</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OMODE15</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>OSSEL</name>
        <displayName>OSSEL</displayName>
        <description>GPIO port output speed register</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xC000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>OSSEL0</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL1</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL2</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL3</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL4</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL5</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL6</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL7</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL8</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL9</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        <field>
            <name>OSSEL10</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL11</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL12</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL13</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL14</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSEL15</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>PUPD</name>
        <displayName>PUPD</displayName>
        <description>GPIO port pull-up/pull-down register</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x64000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PUPD0</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD1</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD2</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD3</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD4</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD5</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD6</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD7</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD8</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD9</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        <field>
            <name>PUPD10</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD11</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD12</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD13</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD14</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PUPD15</name>
            <description>Port x configuration bits (y = 0..15)</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
