Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C2</name>
      <description>Inter-integrated circuit</description>
      <groupName>I2C</groupName>
      <baseAddress>0x40005800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>I2C2_EV</name>
        <description>I2C2 event interrupt</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>I2C2_ER</name>
        <description>I2C2 error interrupt</description>
        <value>34</value>
      </interrupt>
      <registers>
      <register>
        <name>CLKCTRL</name>
        <displayName>CLKCTRL</displayName>
        <description>Clock control register</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CLKS</name>
            <description>Clock control register in Fast/Standard mode(Master mode)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
          <field>
            <name>FDUTYCFG</name>
            <description>Fast mode duty cycle</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPEEDCFG</name>
            <description>Master Mode Speed Configure</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTRL1</name>
        <displayName>CTRL1</displayName>
        <description>Control register 1</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>I2CEN</name>
            <description>I2C enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SMBEN</name>
            <description>SMBus mode</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SMBTCFG</name>
            <description>SMBus type</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ARPEN</name>
            <description>ARP enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PECEN</name>
            <description>PEC enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SRBEN</name>
            <description>General call enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CLKSTRETCHD</name>
            <description>Clock stretching disable (Slave mode)</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>START</name>
            <description>Start generation</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STOP</name>
            <description>Stop generation</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ACKEN</name>
            <description>Acknowledge enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ACKPOS</name>
            <description>Acknowledge/PEC Position (for data reception)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PEC</name>
            <description>Packet error checking</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ALERTEN</name>
            <description>SMBus alert</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWRST</name>
            <description>Software reset</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTRL2</name>
        <displayName>CTRL2</displayName>
        <description>Control register 2</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CLKFCFG</name>
            <description>I2C clock frequency</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>ERRIEN</name>
            <description>Error interrupt enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EVIEN</name>
            <description>Event interrupt enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BUFIEN</name>
            <description>Buffer interrupt enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMAEN</name>
            <description>DMA requests enable</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LTCFG</name>
            <description>DMA last transfer</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DATA</name>
        <displayName>DATA</displayName>
        <description>Data register</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DATA</name>
            <description>8-bit data register</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FILTER</name>
        <displayName>FILTER</displayName>
        <description>Filter control register</description>
        <addressOffset>0x24</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DNFCFG</name>
            <description>Digitial Noise Filter Filtering Capabitity Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>RISETMAX</name>
            <description>Analog Noise Filter Disable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RISETMAX</name>
        <displayName>RISETMAX</displayName>
        <description>Maximum Rise Time register</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x2</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RISETMAX</name>
            <description>Maximum rise time in Fast/Standard mode (Master mode)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SADDR1</name>
        <displayName>SADDR1</displayName>
        <description>Own address register 1</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ADDR0</name>
            <description>Interface address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADDR7</name>
            <description>Interface address</description>
            <bitOffset>1</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>ADDR10</name>
            <description>Interface address</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>ADDRLEN</name>
            <description>Addressing mode (slave mode)</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SADDR2</name>
        <displayName>SADDR2</displayName>
        <description>Own address register 2</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ADDRNUM</name>
            <description>Slave Address Number Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>ADDR2</name>
            <description>Interface address</description>
            <bitOffset>1</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>STS1</name>
        <displayName>STS1</displayName>
        <description>Status register 1</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>STARTFLG</name>
            <description>Start bit (Master mode)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ADDRFLG</name>
            <description>Address sent (master mode)/matched (slavemode)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>BTCFLG</name>
            <description>Byte transfer finished</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ADDR10FLG</name>
            <description>10-bit header sent (Master mode)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>STOPFLG</name>
            <description>Stop detection (slave mode)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RXBNEFLG</name>
            <description>Data register not empty (receivers)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXBEFLG</name>
            <description>Data register empty (transmitters)</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        <field>
            <name>BERRFLG</name>
            <description>Bus error</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ALFLG</name>
            <description>Arbitration lost (master mode)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>AEFLG</name>
            <description>Acknowledge failure</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OVRURFLG</name>
            <description>Overrun/Underrun</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PECEFLG</name>
            <description>PEC Error in reception</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TTEFLG</name>
            <description>Timeout or Tlow error</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SMBALTFLG</name>
            <description>SMBus alert</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>STS2</name>
        <displayName>STS2</displayName>
        <description>Status register 2</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MSFLG</name>
            <description>Master Slave Mode Flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BUSBSYFLG</name>
            <description>Bus busy</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRFLG</name>
            <description>Transmitter/receiver</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>GENCALLFLG</name>
            <description>General call address (Slave mode)</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SMBDADDRFLG</name>
            <description>SMBus device default address (Slave mode)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SMMHADDR</name>
            <description>SMBus host header (Slave mode)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DUALADDRFLG</name>
            <description>Dual flag (Slave mode)</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PECVALUE</name>
            <description>Save Packet Error Checking Value</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          </fields>
      </register>
