Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>ISER0</name>
        <displayName>ISER0</displayName>
        <description>Interrupt Set-Enable Register</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <!-- 0 -->
          <field>
            <name>WWDT_IRQn</name>
            <description>Window WatchDog Interrupt</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 1 -->
          <field>
            <name>PVD_IRQn</name>
            <description>PVD through EINT Line detection Interrupt</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 2 -->
          <field>
            <name>TAMP_STAMP_IRQn</name>
            <description>Tamper/TimeStamp Interrupt</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 3 -->
          <field>
            <name>RTC_WKUP_IRQn</name>
            <description>RTC Wakeup Interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 4 -->
          <field>
            <name>FLASH_IRQn</name>
            <description>FLASH global Interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 5 -->
          <field>
            <name>RCM_IRQn</name>
            <description>RCM global Interrupt</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 6 -->
          <field>
            <name>EINT0_IRQn</name>
            <description>External Line0 Interrupt</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 7 -->
          <field>
            <name>EINT1_IRQn</name>
            <description>External Line1 Interrupt</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 8 -->
          <field>
            <name>EINT2_IRQn</name>
            <description>External Line2 Interrupt</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 9 -->
          <field>
            <name>EINT3_IRQn</name>
            <description>External Line3 Interrupt</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 10 -->
          <field>
            <name>EINT4_IRQn</name>
            <description>External Line4 Interrupt</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 11 -->
          <field>
            <name>DMA1_STR0_IRQn</name>
            <description>DMA1 Stream0 global Interrupt</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 12 -->
          <field>
            <name>DMA1_STR1_IRQn</name>
            <description>DMA1 Stream1 global Interrupt</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 13 -->
          <field>
            <name>DMA1_STR2_IRQn</name>
            <description>DMA1 Stream2 global Interrupt</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 14 -->
          <field>
            <name>DMA1_STR3_IRQn</name>
            <description>DMA1 Stream3 global Interrupt</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 15 -->
          <field>
            <name>DMA1_STR4_IRQn</name>
            <description>DMA1 Stream4 global Interrupt</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 16 -->
          <field>
            <name>DMA1_STR5_IRQn</name>
            <description>DMA1 Stream5 global Interrupt</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 17 -->
          <field>
            <name>DMA1_STR6_IRQn</name>
            <description>DMA1 Stream6 global Interrupt</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 18 -->
          <field>
            <name>ADC_IRQn</name>
            <description>ADC Interrupt</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 19 -->
          <field>
            <name>CAN1_TX_IRQn</name>
            <description>CAN1 TX Interrupt</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 20 -->
          <field>
            <name>CAN1_RX0_IRQn</name>
            <description>CAN1 RX0 Interrupt</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 21 -->
          <field>
            <name>CAN1_RX1_IRQn</name>
            <description>CAN1 RX1 Interrupt</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 22 -->
          <field>
            <name>CAN1_SCE_IRQn</name>
            <description>CAN1 SCE Interrupt</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 23 -->
          <field>
            <name>EINT9_5_IRQn</name>
            <description>External Lines [9:5] Interrupt</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 24 -->
          <field>
            <name>TMR1_BRK_TMR9_IRQn</name>
            <description>TMR1 Break AND TMR9 global Interrupt</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 25 -->
          <field>
            <name>TMR1_UP_TMR10_IRQn</name>
            <description>TMR1 Update AND TMR10 global Interrupt</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 26 -->
          <field>
            <name>TMR1_TRG_COM_TMR11_IRQn</name>
            <description>TMR1 Trigger AND TMR11 global Interrupt</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 27 -->
          <field>
            <name>TMR1_CC_IRQn</name>
            <description>TMR1 Capture/Compare Interrupt</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 28 -->
          <field>
            <name>TMR2_IRQn</name>
            <description>TMR2 global Interrupt</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 29 -->
          <field>
            <name>TMR3_IRQn</name>
            <description>TMR3 global Interrupt</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 30 -->
          <field>
            <name>TMR4_IRQn</name>
            <description>TMR4 global Interrupt</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 31 -->
          <field>
            <name>I2C1_EV_IRQn</name>
            <description>I2C1 Event Interrupt</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER1</name>
        <displayName>ISER1</displayName>
        <description>Interrupt Set-Enable Register</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <!-- 32 -->
          <field>
            <name>I2C1_ER_IRQn</name>
            <description>I2C1 Error Interrupt</description>
            <!-- bitOffset is IRQn - 32 -->
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 33 -->
          <field>
            <name>I2C2_EV_IRQn</name>
            <description>I2C2 Event Interrupt</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 34 -->
          <field>
            <name>I2C2_ER_IRQn</name>
            <description>I2C2 Error Interrupt</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 35 -->
          <field>
            <name>SPI1_IRQn</name>
            <description>SPI1 global Interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 36 -->
          <field>
            <name>SPI2_IRQn</name>
            <description>SPI2 global Interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 37 -->
          <field>
            <name>USART1_IRQn</name>
            <description>USART1 global Interrupt</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 38 -->
          <field>
            <name>USART2_IRQn</name>
            <description>USART2 global Interrupt</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 39 -->
          <field>
            <name>USART3_IRQn</name>
            <description>USART3 global Interrupt</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 40 -->
          <field>
            <name>EINT15_10_IRQn</name>
            <description>External Line[15:10] Interrupts Enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 41 -->
          <field>
            <name>RTC_Alarm_IRQn</name>
            <description>RTC Alarm (A and B) through EINT Line Interrupt</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 42 -->
          <field>
            <name>OTG_FS_WKUP_IRQn</name>
            <description>OTG_FS Wakeup through EINT line Interrupt</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 43 -->
          <field>
            <name>TMR8_BRK_TMR12_IRQn</name>
            <description>TMR8 Break AND TMR12 global Interrupt</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 44 -->
          <field>
            <name>TMR8_UP_TMR13_IRQn</name>
            <description>TMR8 Update AND TMR13 global Interrupt</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 45 -->
          <field>
            <name>TMR8_TRG_COM_TMR14_IRQn</name>
            <description>TMR8 Trigger/Commutation AND TMR14 global Interrupt</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 46 -->
          <field>
            <name>TMR8_CC_IRQn</name>
            <description>TMR8 Capture Compare Interrupt</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 47 -->
          <field>
            <name>DMA1_STR7_IRQn</name>
            <description>DMA1 Stream7 Interrupt</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 48 -->
          <field>
            <name>EMMC_IRQn</name>
            <description>FSMC/EMMC global Interrupt</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 49 -->
          <field>
            <name>SDIO_IRQn</name>
            <description>SDIO global Interrupt</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 50 -->
          <field>
            <name>TMR5_IRQn</name>
            <description>TMR5 global Interrupt</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 51 -->
          <field>
            <name>SPI3_IRQn</name>
            <description>SPI3 global Interrupt</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 52 -->
          <field>
            <name>UART4_IRQn</name>
            <description>UART4 global Interrupt</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 53 -->
          <field>
            <name>UART5_IRQn</name>
            <description>UART5 global Interrupt</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 54, 55 not present in enum -->
          <!-- 56 -->
          <field>
            <name>DMA2_STR0_IRQn</name>
            <description>DMA2 Stream0 global Interrupt</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 57 -->
          <field>
            <name>DMA2_STR1_IRQn</name>
            <description>DMA2 Stream1 global Interrupt</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 58 -->
          <field>
            <name>DMA2_STR2_IRQn</name>
            <description>DMA2 Stream2 global Interrupt</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 59 -->
          <field>
            <name>DMA2_STR3_IRQn</name>
            <description>DMA2 Stream3 global Interrupt</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 60 -->
          <field>
            <name>DMA2_STR4_IRQn</name>
            <description>DMA2 Stream4 global Interrupt</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 61, 62 not present enum -->
          <!-- 63 -->
          <field>
            <name>CAN2_TX_IRQn</name>
            <description>CAN2 TX Interrupt</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISER2</name>
        <displayName>ISER2</displayName>
        <description>Interrupt Set-Enable Register</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <!-- 64 -->
          <field>
            <name>CAN2_RX0_IRQn</name>
            <description>CAN2 RX0 Interrupt</description>
            <!-- bitOffset = 64 - 64 = 0 -->
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 65 -->
          <field>
            <name>CAN2_RX1_IRQn</name>
            <description>CAN2 RX1 Interrupt</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 66 -->
          <field>
            <name>CAN2_SCE_IRQn</name>
            <description>CAN2 SCE Interrupt</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 67 -->
          <field>
            <name>OTG_FS_IRQn</name>
            <description>OTG_FS global Interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 68 -->
          <field>
            <name>DMA2_STR5_IRQn</name>
            <description>DMA2 Stream5 global Interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 69 -->
          <field>
            <name>DMA2_STR6_IRQn</name>
            <description>DMA2 Stream6 global Interrupt</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 70 -->
          <field>
            <name>DMA2_STR7_IRQn</name>
            <description>DMA2 Stream7 global Interrupt</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 71 -->
          <field>
            <name>USART6_IRQn</name>
            <description>USART6 global Interrupt</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 72 -->
          <field>
            <name>I2C3_EV_IRQn</name>
            <description>I2C3 event Interrupt</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 73 -->
          <field>
            <name>I2C3_ER_IRQn</name>
            <description>I2C3 error Interrupt</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 74..79 missing in enum -->
          <!-- 80 -->
          <field>
            <name>RNG_IRQn</name>
            <description>RNG global Interrupt</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 81 -->
          <field>
            <name>FPU_IRQn</name>
            <description>FPU global Interrupt</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 82 missing in enum -->
          <!-- 83 -->
          <field>
            <name>QSPI_IRQn</name>
            <description>QSPI global Interrupt</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 84 -->
          <field>
            <name>SPI4_IRQn</name>
            <description>SPI4 global Interrupt</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- 85 -->
          <field>
            <name>SPI5_IRQn</name>
            <description>SPI5 global Interrupt</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- Bits above 85 are unused, only 86 interrupts in total -->
        </fields>
      </register>
