Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OTG_FS_DEVICE</name>
      <description>USB on the go full speed</description>
      <groupName>USB_OTG_FS</groupName>
      <baseAddress>0x50000800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>DAEPIMASK</name>
        <displayName>DAEPIMASK</displayName>
        <description>OTG_FS all endpoints interrupt mask register (OTG_FS_DAINTMSK)</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>AINM</name>
            <description>IN EP interrupt mask bits</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>AOUTM</name>
            <description>OUT endpoint interrupt bits</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DAEPINT</name>
        <displayName>DAEPINT</displayName>
        <description>OTG_FS device all endpoints interrupt register (OTG_FS_DAINT)</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>INEPINT</name>
            <description>IN endpoint interrupt bits</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>OUTEPINT</name>
            <description>OUT endpoint interrupt bits</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DCFG</name>
        <displayName>DCFG</displayName>
        <description>OTG_FS device configuration register (OTG_FS_DCFG)</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x2200000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DSPDSEL</name>
            <description>Device speed</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SENDOUT</name>
            <description>Non-zero-length status OUT handshake</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>DADDR</name>
            <description>Device address</description>
            <bitOffset>4</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>PFITV</name>
            <description>Periodic frame interval</description>
            <bitOffset>11</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>DCTRL</name>
        <displayName>DCTRL</displayName>
        <description>OTG_FS device control register (OTG_FS_DCTL)</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RWKUPS</name>
            <description>Remote wakeup signaling</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SDCNNT</name>
            <description>Soft disconnect</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GINAKSTS</name>
            <description>Global IN NAK status</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>GONAKSTS</name>
            <description>Global OUT NAK status</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TESTSEL</name>
            <description>Test control</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>GINAKSET</name>
            <description>Set global IN NAK</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GINAKCLR</name>
            <description>Clear global IN NAK</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GONAKSET</name>
            <description>Set global OUT NAK</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GONAKCLR</name>
            <description>Clear global OUT NAK</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>POPROGCMP</name>
            <description>Power-on programming done</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>DIEIMASK</name>
        <displayName>DIEIMASK</displayName>
        <description>OTG_FS device IN endpoint FIFO empty interrupt mask register</description>
        <addressOffset>0x34</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>INEM</name>
            <description>IN EP Tx FIFO empty interrupt mask bits</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPCTRL0</name>
        <displayName>DIEPCTRL0</displayName>
        <description>OTG_FS device control IN endpoint 0 control register (OTG_FS_DIEPCTL0)</description>
        <addressOffset>0x100</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPS</name>
            <description>Maximum packet size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USBAEP</name>
            <description>USB active endpoint</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        <field>
            <name>NAKSTST</name>
            <description>NAK status</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>EPTYPE</name>
            <description>Endpoint type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>STALLH</name>
            <description>STALL handshake</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXFNUM</name>
            <description>TxFIFO number</description>
            <bitOffset>22</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>NAKCLR</name>
            <description>Clear NAK</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>NAKSET</name>
            <description>Set NAK</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>EPDIS</name>
            <description>Endpoint disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>EPEN</name>
            <description>Endpoint enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          </fields>
      </register>
      <register>
        <name>DIEPCTRL1</name>
        <displayName>DIEPCTRL1</displayName>
        <description>OTG device endpoint-1 control register</description>
        <addressOffset>0x120</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPS</name>
            <description>Maximum Packet Size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USBAEP</name>
            <description>USB Active Endpoint</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>EOF</name>
            <description>Even Odd Frame Select</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>NAKSTS</name>
            <description>NAK Status Configure</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>EPTYPE</name>
            <description>Endpoint Type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STALLH</name>
            <description>STALL Handshake</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXFNUM</name>
            <description>TXFIFO Number</description>
            <bitOffset>22</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>NAKCLR</name>
            <description>NAK Clear</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>NAKSET</name>
            <description>NAK Set</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>DPIDSET</name>
            <description>DATA0 PID Set</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>OFSET</name>
            <description>Odd Frame Set</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>EPDIS</name>
            <description>Endpoint Disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EPEN</name>
            <description>Endpoint Enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>DIEPCTRL2</name>
        <displayName>DIEPCTRL2</displayName>
        <description>OTG device endpoint-2 control register</description>
        <addressOffset>0x140</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPS</name>
            <description>Maximum Packet Size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USBAEP</name>
            <description>USB Active Endpoint</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>EOF</name>
            <description>Even Odd Frame Select</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>NAKSTS</name>
            <description>NAK Status Configure</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>EPTYPE</name>
            <description>Endpoint Type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STALLH</name>
            <description>STALL Handshake</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXFNUM</name>
            <description>TXFIFO Number</description>
            <bitOffset>22</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>NAKCLR</name>
            <description>NAK Clear</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>NAKSET</name>
            <description>NAK Set</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>DPIDSET</name>
            <description>DATA0 PID Set</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>OFSET</name>
            <description>Odd Frame Set</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>EPDIS</name>
            <description>Endpoint Disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EPEN</name>
            <description>Endpoint Enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>DIEPCTRL3</name>
        <displayName>DIEPCTRL3</displayName>
        <description>OTG device endpoint-3 control register</description>
        <addressOffset>0x160</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPS</name>
            <description>Maximum Packet Size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USBAEP</name>
            <description>USB Active Endpoint</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>EOF</name>
            <description>Even Odd Frame Select</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>NAKSTS</name>
            <description>NAK Status Configure</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>EPTYPE</name>
            <description>Endpoint Type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STALLH</name>
            <description>STALL Handshake</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXFNUM</name>
            <description>TXFIFO Number</description>
            <bitOffset>22</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>NAKCLR</name>
            <description>NAK Clear</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>NAKSET</name>
            <description>NAK Set</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>DPIDSET</name>
            <description>DATA0 PID Set</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>OFSET</name>
            <description>Odd Frame Set</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>EPDIS</name>
            <description>Endpoint Disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EPEN</name>
            <description>Endpoint Enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>DIEPINT0</name>
        <displayName>DIEPINT0</displayName>
        <description>device endpoint-x interrupt register</description>
        <addressOffset>0x108</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x80</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFCMP</name>
            <description>Transfer Complete Interrupt</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EPDIS</name>
            <description>Endpoint Interrupt Disable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TO</name>
            <description>Timeout Interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ITXEMP</name>
            <description>Receive IN Token Interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IEPNAKE</name>
            <description>IN Endpoint NAK Effective</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXFE</name>
            <description>TXFIFO Empty Interrupt</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        <field>
            <name>PDSTS</name>
            <description>Packet Dropped Status</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INNAK</name>
            <description>Input NAK Interrupt</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
