Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>DIEPINT1</name>
        <displayName>DIEPINT1</displayName>
        <description>device endpoint-1 interrupt register</description>
        <addressOffset>0x128</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x80</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFCMP</name>
            <description>Transfer Complete Interrupt</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EPDIS</name>
            <description>Endpoint Interrupt Disable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TO</name>
            <description>Timeout Interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ITXEMP</name>
            <description>Receive IN Token Interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IEPNAKE</name>
            <description>IN Endpoint NAK Effective</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXFE</name>
            <description>TXFIFO Empty Interrupt</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        <field>
            <name>PDSTS</name>
            <description>Packet Dropped Status</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INNAK</name>
            <description>Input NAK Interrupt</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>DIEPINT2</name>
        <displayName>DIEPINT2</displayName>
        <description>device endpoint-2 interrupt register</description>
        <addressOffset>0x148</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x80</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFCMP</name>
            <description>Transfer Complete Interrupt</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EPDIS</name>
            <description>Endpoint Interrupt Disable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TO</name>
            <description>Timeout Interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ITXEMP</name>
            <description>Receive IN Token Interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IEPNAKE</name>
            <description>IN Endpoint NAK Effective</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXFE</name>
            <description>TXFIFO Empty Interrupt</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        <field>
            <name>PDSTS</name>
            <description>Packet Dropped Status</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INNAK</name>
            <description>Input NAK Interrupt</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>DIEPINT3</name>
        <displayName>DIEPINT3</displayName>
        <description>device endpoint-3 interrupt register</description>
        <addressOffset>0x168</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x80</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFCMP</name>
            <description>Transfer Complete Interrupt</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EPDIS</name>
            <description>Endpoint Interrupt Disable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TO</name>
            <description>Timeout Interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ITXEMP</name>
            <description>Receive IN Token Interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IEPNAKE</name>
            <description>IN Endpoint NAK Effective</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXFE</name>
            <description>TXFIFO Empty Interrupt</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        <field>
            <name>PDSTS</name>
            <description>Packet Dropped Status</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INNAK</name>
            <description>Input NAK Interrupt</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>DIEPTRS0</name>
        <displayName>DIEPTRS0</displayName>
        <description>device endpoint-0 transfer size register</description>
        <addressOffset>0x110</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>EPTRS</name>
            <description>Transfer size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
        <field>
            <name>EPPCNT</name>
            <description>Packet count</description>
            <bitOffset>19</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>DIEPTRS1</name>
        <displayName>DIEPTRS1</displayName>
        <description>device endpoint-1 transfer size register</description>
        <addressOffset>0x130</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>EPTRS</name>
            <description>Transfer size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
        <field>
            <name>EPPCNT</name>
            <description>Packet count</description>
            <bitOffset>19</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>DIEPTRS2</name>
        <displayName>DIEPTRS2</displayName>
        <description>device endpoint-2 transfer size register</description>
        <addressOffset>0x150</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>EPTRS</name>
            <description>Transfer size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
        <field>
            <name>EPPCNT</name>
            <description>Packet count</description>
            <bitOffset>19</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>DIEPTRS3</name>
        <displayName>DIEPTRS3</displayName>
        <description>device endpoint-3 transfer size register</description>
        <addressOffset>0x170</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>EPTRS</name>
            <description>Transfer size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
        <field>
            <name>EPPCNT</name>
            <description>Packet count</description>
            <bitOffset>19</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>DINIMASK</name>
        <displayName>DINIMASK</displayName>
        <description>OTG_FS device IN endpoint common interrupt mask register (OTG_FS_DIEPMSK)</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFCMPM</name>
            <description>Transfer completed interrupt mask</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>EPDISM</name>
            <description>Endpoint disabled interrupt mask</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TOM</name>
            <description>Timeout condition mask (Non-isochronous endpoints)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ITXEMPM</name>
            <description>IN token received when TxFIFO empty mask</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IEPMMM</name>
            <description>IN token received with EP mismatch mask</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IEPNAKEM</name>
            <description>IN endpoint NAK effective mask</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NAKM</name>
            <description>NAK Interrupt Mask</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>DITXFSTS0</name>
        <displayName>DITXFSTS0</displayName>
        <description>OTG_FS device IN endpoint transmit FIFO status register</description>
        <addressOffset>0x118</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>INEPTXFSASEL</name>
            <description>IN endpoint TxFIFO space available</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DITXFSTS1</name>
        <displayName>DITXFSTS1</displayName>
        <description>OTG_FS device IN endpoint transmit FIFO status register</description>
        <addressOffset>0x138</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>INEPTXFSASEL</name>
            <description>IN endpoint TxFIFO space available</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DITXFSTS2</name>
        <displayName>DITXFSTS2</displayName>
        <description>OTG_FS device IN endpoint transmit FIFO status register</description>
        <addressOffset>0x158</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>INEPTXFSASEL</name>
            <description>IN endpoint TxFIFO space available</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DITXFSTS3</name>
        <displayName>DITXFSTS3</displayName>
        <description>OTG_FS device IN endpoint transmit FIFO status register</description>
        <addressOffset>0x178</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>INEPTXFSASEL</name>
            <description>IN endpoint TxFIFO space available</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DOEPCTRL0</name>
        <displayName>DOEPCTRL0</displayName>
        <description>device endpoint-0 control register</description>
        <addressOffset>0x300</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x8000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPS</name>
            <description>Maximum Packet Size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>USBAEP</name>
            <description>USB Active Endpoint</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        <field>
            <name>NAKSTS</name>
            <description>NAK Status Configure</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>EPTYPE</name>
            <description>Endpoint Type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SNMEN</name>
            <description>Snoop Mode Enable</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STALLH</name>
            <description>STALL Handshake</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>NAKCLR</name>
            <description>NAK Clear</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>NAKSET</name>
            <description>NAK Set</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>EPDIS</name>
            <description>Endpoint Disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>EPEN</name>
            <description>Endpoint Enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          </fields>
      </register>
      <register>
        <name>DOEPCTRL1</name>
        <displayName>DOEPCTRL1</displayName>
        <description>device endpoint-1 control register</description>
        <addressOffset>0x320</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPS</name>
            <description>Maximum Packet Size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USBAEP</name>
            <description>USB Active Endpoint</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>EOF</name>
            <description>Even Odd Frame Select</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>NAKSTS</name>
            <description>NAK Status Configure</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>EPTYPE</name>
            <description>Endpoint Type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STALLH</name>
            <description>STALL Handshake</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>NAKCLR</name>
            <description>NAK Clear</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>NAKSET</name>
            <description>NAK Set</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>DPIDSET</name>
            <description>DATA0 PID Set</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>OFSET</name>
            <description>Odd Frame Set</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>EPDIS</name>
            <description>Endpoint Disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EPEN</name>
            <description>Endpoint Enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
