Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>GINTMASK</name>
        <displayName>GINTMASK</displayName>
        <description>OTG_FS interrupt mask register (OTG_FS_GINTMSK)</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MMISM</name>
            <description>Mode mismatch interrupt mask</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OTGM</name>
            <description>OTG interrupt mask</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SOFM</name>
            <description>Start of frame mask</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RXFNONEM</name>
            <description>Receive FIFO non-empty mask</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>NPTXFEMM</name>
            <description>Non-periodic TxFIFO empty mask</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GINNPNAKEM</name>
            <description>Global non-periodic IN NAK effective mask</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GONAKEM</name>
            <description>Global OUT NAK effective mask</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ESUSM</name>
            <description>Early suspend mask</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USBSUSM</name>
            <description>USB suspend mask</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>USBRSTM</name>
            <description>USB reset mask</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENUMDM</name>
            <description>Enumeration done mask</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ISOPDM</name>
            <description>Isochronous OUT packet dropped interrupt mask</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EOPFM</name>
            <description>End of periodic frame interrupt mask</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EPMISM</name>
            <description>Endpoint mismatch interrupt mask</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INEPM</name>
            <description>IN endpoints interrupt mask</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OUTEPM</name>
            <description>OUT endpoints interrupt mask</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IIINTXM</name>
            <description>Incomplete isochronous IN transfer mask</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_OUTTXM</name>
            <description>Incomplete periodic transfer mask(Host
 mode)/Incomplete isochronous OUT transfer mask(Device mode)</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HPORTM</name>
            <description>Host port interrupt mask</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HCHANM</name>
            <description>Host channels interrupt mask</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PTXFEM</name>
            <description>Periodic TxFIFO empty mask</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CIDSTSTCM</name>
            <description>Connector ID status change mask</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DEDISM</name>
            <description>Disconnect detected interrupt mask</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SREQM</name>
            <description>Session request/new session detected interrupt mask</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RWAKEM</name>
            <description>Resume/remote wakeup detected interrupt mask</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>GNPTXFQSTS</name>
        <displayName>GNPTXFQSTS</displayName>
        <description>OTG_FS non-periodic transmit FIFO/queue statusregister (OTG_FS_GNPTXFQSTS)</description>
        <addressOffset>0x2C</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x80200</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>NPTXFSA</name>
            <description>Non-periodic TxFIFO space available</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>NPTXRSA</name>
            <description>Non-periodic transmit request queue space available</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>NPTXRQ</name>
            <description>Top of the non-periodic transmit request queue</description>
            <bitOffset>24</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>GRSTCTRL</name>
        <displayName>GRSTCTRL</displayName>
        <description>OTG_FS reset register (OTG_FS_GRSTCTL)</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x20000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CSRST</name>
            <description>Core soft reset</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HSRST</name>
            <description>HCLK soft reset</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HFCNTRST</name>
            <description>Host frame counter reset</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RXFFLU</name>
            <description>RxFIFO flush</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXFFLU</name>
            <description>TxFIFO flush</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXFNUM</name>
            <description>TxFIFO number</description>
            <bitOffset>6</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>AHBMIDL</name>
            <description>AHB master idle</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          </fields>
      </register>
      <register>
        <name>GRXFIFO</name>
        <displayName>GRXFIFO</displayName>
        <description>OTG_FS Receive FIFO size register (OTG_FS_GRXFSIZ)</description>
        <addressOffset>0x24</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x200</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RXFDEP</name>
            <description>RxFIFO depth</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GRXSTS</name>
        <displayName>GRXSTS</displayName>
        <description>OTG_FS Receive status debug read(Device mode)</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>EPNUM</name>
            <description>Endpoint number</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>BCNT</name>
            <description>Byte count</description>
            <bitOffset>4</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>DPID</name>
            <description>Data PID</description>
            <bitOffset>15</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PSTS</name>
            <description>Packet status</description>
            <bitOffset>17</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        <field>
            <name>FNUM</name>
            <description>Frame number</description>
            <bitOffset>21</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>GRXSTSP</name>
        <displayName>GRXSTSP</displayName>
        <description>OTG_FS Receive status debug read(Host mode)</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CHNUM</name>
            <description>Endpoint number</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>BCNT</name>
            <description>Byte count</description>
            <bitOffset>4</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>DPID</name>
            <description>Data PID</description>
            <bitOffset>15</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PSTS</name>
            <description>Packet status</description>
            <bitOffset>17</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GTXFCFG</name>
        <displayName>GTXFCFG</displayName>
        <description>OTG_FS non-periodic transmit FIFO size register (Device mode)</description>
        <addressOffset>0x28</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x200</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>EPTXSA</name>
            <description>Endpoint 0 transmit RAM start address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        <field>
            <name>EPTXFDEP</name>
            <description>Endpoint 0 TxFIFO depth</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>GTXFCFGH</name>
        <displayName>GTXFCFGH</displayName>
        <description>OTG_FS non-periodic transmit FIFO size register (Host mode)</description>
        <addressOffset>0x28</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x200</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>NPTXSA</name>
            <description>Non-periodic transmit RAM start address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        <field>
            <name>NPTXFDEP</name>
            <description>Non-periodic TxFIFO depth</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>GUSBCFG</name>
        <displayName>GUSBCFG</displayName>
        <description>OTG_FS USB configuration register (OTG_FS_GUSBCFG)</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0xA00</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SEFLG</name>
            <description>FS timeout calibration</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FSSTSEL</name>
            <description>Full Speed serial transceiver select</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>SRPEN</name>
            <description>SRP-capable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HNPEN</name>
            <description>HNP-capable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TRTIM</name>
            <description>USB turnaround time</description>
            <bitOffset>10</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>FHMODE</name>
            <description>Force host mode</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FDMODE</name>
            <description>Force device mode</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CTXP</name>
            <description>Corrupt Tx packet</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
