Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OTG_FS_HOST</name>
      <description>USB on the go full speed</description>
      <groupName>USB_OTG_FS</groupName>
      <baseAddress>0x50000400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>HACHIMASK</name>
        <displayName>HACHIMASK</displayName>
        <description>OTG_FS host all channels interrupt mask register</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ACHIMASK</name>
            <description>Channel interrupt mask</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HACHINT</name>
        <displayName>HACHINT</displayName>
        <description>OTG_FS Host all channels interrupt register</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ACHINT</name>
            <description>Channel interrupts</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HCFG</name>
        <displayName>HCFG</displayName>
        <description>OTG_FS host configuration register (OTG_FS_HCFG)</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PHYCLKSEL</name>
            <description>FS/LS PHY clock select</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>FSSPT</name>
            <description>FS- and LS-only support</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          </fields>
      </register>
      <register>
        <name>HCH0</name>
        <displayName>HCH0</displayName>
        <description>OTG_FS host channel-0 characteristics register (OTG_FS_HCCHAR0)</description>
        <addressOffset>0x100</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPSIZE</name>
            <description>Maximum packet size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>EDPNUM</name>
            <description>Endpoint number</description>
            <bitOffset>11</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EDPDRT</name>
            <description>Endpoint direction</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LSDV</name>
            <description>Low-speed device</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EDPTYP</name>
            <description>Endpoint type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CNTSEL</name>
            <description>Multicount</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DVADDR</name>
            <description>Device address</description>
            <bitOffset>22</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>ODDF</name>
            <description>Odd frame</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CHINT</name>
            <description>Channel disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHEN</name>
            <description>Channel enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCH1</name>
        <displayName>HCH1</displayName>
        <description>OTG_FS host channel-1 characteristics register (OTG_FS_HCCHAR1)</description>
        <addressOffset>0x120</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPSIZE</name>
            <description>Maximum packet size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>EDPNUM</name>
            <description>Endpoint number</description>
            <bitOffset>11</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EDPDRT</name>
            <description>Endpoint direction</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LSDV</name>
            <description>Low-speed device</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EDPTYP</name>
            <description>Endpoint type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CNTSEL</name>
            <description>Multicount</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DVADDR</name>
            <description>Device address</description>
            <bitOffset>22</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>ODDF</name>
            <description>Odd frame</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CHINT</name>
            <description>Channel disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHEN</name>
            <description>Channel enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCH2</name>
        <displayName>HCH2</displayName>
        <description>OTG_FS host channel-2 characteristics register (OTG_FS_HCCHAR2)</description>
        <addressOffset>0x140</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPSIZE</name>
            <description>Maximum packet size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>EDPNUM</name>
            <description>Endpoint number</description>
            <bitOffset>11</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EDPDRT</name>
            <description>Endpoint direction</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LSDV</name>
            <description>Low-speed device</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EDPTYP</name>
            <description>Endpoint type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CNTSEL</name>
            <description>Multicount</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DVADDR</name>
            <description>Device address</description>
            <bitOffset>22</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>ODDF</name>
            <description>Odd frame</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CHINT</name>
            <description>Channel disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHEN</name>
            <description>Channel enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCH3</name>
        <displayName>HCH3</displayName>
        <description>OTG_FS host channel-3 characteristics register (OTG_FS_HCCHAR3)</description>
        <addressOffset>0x160</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPSIZE</name>
            <description>Maximum packet size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>EDPNUM</name>
            <description>Endpoint number</description>
            <bitOffset>11</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EDPDRT</name>
            <description>Endpoint direction</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LSDV</name>
            <description>Low-speed device</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EDPTYP</name>
            <description>Endpoint type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CNTSEL</name>
            <description>Multicount</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DVADDR</name>
            <description>Device address</description>
            <bitOffset>22</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>ODDF</name>
            <description>Odd frame</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CHINT</name>
            <description>Channel disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHEN</name>
            <description>Channel enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCH4</name>
        <displayName>HCH4</displayName>
        <description>OTG_FS host channel-4 characteristics register (OTG_FS_HCCHAR4)</description>
        <addressOffset>0x180</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPSIZE</name>
            <description>Maximum packet size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>EDPNUM</name>
            <description>Endpoint number</description>
            <bitOffset>11</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EDPDRT</name>
            <description>Endpoint direction</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LSDV</name>
            <description>Low-speed device</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EDPTYP</name>
            <description>Endpoint type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CNTSEL</name>
            <description>Multicount</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DVADDR</name>
            <description>Device address</description>
            <bitOffset>22</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>ODDF</name>
            <description>Odd frame</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CHINT</name>
            <description>Channel disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHEN</name>
            <description>Channel enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCH5</name>
        <displayName>HCH5</displayName>
        <description>OTG_FS host channel-5 characteristics register (OTG_FS_HCCHAR5)</description>
        <addressOffset>0x1A0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPSIZE</name>
            <description>Maximum packet size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>EDPNUM</name>
            <description>Endpoint number</description>
            <bitOffset>11</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EDPDRT</name>
            <description>Endpoint direction</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LSDV</name>
            <description>Low-speed device</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EDPTYP</name>
            <description>Endpoint type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CNTSEL</name>
            <description>Multicount</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DVADDR</name>
            <description>Device address</description>
            <bitOffset>22</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>ODDF</name>
            <description>Odd frame</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CHINT</name>
            <description>Channel disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHEN</name>
            <description>Channel enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCH6</name>
        <displayName>HCH6</displayName>
        <description>OTG_FS host channel-6 characteristics register (OTG_FS_HCCHAR6)</description>
        <addressOffset>0x1C0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPSIZE</name>
            <description>Maximum packet size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>EDPNUM</name>
            <description>Endpoint number</description>
            <bitOffset>11</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EDPDRT</name>
            <description>Endpoint direction</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LSDV</name>
            <description>Low-speed device</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EDPTYP</name>
            <description>Endpoint type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CNTSEL</name>
            <description>Multicount</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DVADDR</name>
            <description>Device address</description>
            <bitOffset>22</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>ODDF</name>
            <description>Odd frame</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CHINT</name>
            <description>Channel disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHEN</name>
            <description>Channel enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCH7</name>
        <displayName>HCH7</displayName>
        <description>OTG_FS host channel-7 characteristics register (OTG_FS_HCCHAR7)</description>
        <addressOffset>0x1E0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MAXPSIZE</name>
            <description>Maximum packet size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>EDPNUM</name>
            <description>Endpoint number</description>
            <bitOffset>11</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EDPDRT</name>
            <description>Endpoint direction</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LSDV</name>
            <description>Low-speed device</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EDPTYP</name>
            <description>Endpoint type</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CNTSEL</name>
            <description>Multicount</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DVADDR</name>
            <description>Device address</description>
            <bitOffset>22</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>ODDF</name>
            <description>Odd frame</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CHINT</name>
            <description>Channel disable</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHEN</name>
            <description>Channel enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
