Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>HCHINT1</name>
        <displayName>HCHINT1</displayName>
        <description>OTG_FS host channel-1 interrupt register (OTG_FS_HCINT1)</description>
        <addressOffset>0x128</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFCMPN</name>
            <description>Transfer completed</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>TSFCMPAN</name>
            <description>Channel halted</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXSTALL</name>
            <description>STALL response received interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXNAK</name>
            <description>NAK response received interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXTXACK</name>
            <description>ACK response received/transmitted interrupt</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TERR</name>
            <description>Transaction error</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BABBLE</name>
            <description>Babble error</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FOVR</name>
            <description>Frame overrun</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DTOG</name>
            <description>Data toggle error</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCHINT2</name>
        <displayName>HCHINT2</displayName>
        <description>OTG_FS host channel-2 interrupt register (OTG_FS_HCINT2)</description>
        <addressOffset>0x148</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFCMPN</name>
            <description>Transfer completed</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>TSFCMPAN</name>
            <description>Channel halted</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXSTALL</name>
            <description>STALL response received interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXNAK</name>
            <description>NAK response received interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXTXACK</name>
            <description>ACK response received/transmitted interrupt</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TERR</name>
            <description>Transaction error</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BABBLE</name>
            <description>Babble error</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FOVR</name>
            <description>Frame overrun</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DTOG</name>
            <description>Data toggle error</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCHINT3</name>
        <displayName>HCHINT3</displayName>
        <description>OTG_FS host channel-3 interrupt register (OTG_FS_HCINT3)</description>
        <addressOffset>0x168</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFCMPN</name>
            <description>Transfer completed</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>TSFCMPAN</name>
            <description>Channel halted</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXSTALL</name>
            <description>STALL response received interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXNAK</name>
            <description>NAK response received interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXTXACK</name>
            <description>ACK response received/transmitted interrupt</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TERR</name>
            <description>Transaction error</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BABBLE</name>
            <description>Babble error</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FOVR</name>
            <description>Frame overrun</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DTOG</name>
            <description>Data toggle error</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCHINT4</name>
        <displayName>HCHINT4</displayName>
        <description>OTG_FS host channel-4 interrupt register (OTG_FS_HCINT4)</description>
        <addressOffset>0x188</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFCMPN</name>
            <description>Transfer completed</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>TSFCMPAN</name>
            <description>Channel halted</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXSTALL</name>
            <description>STALL response received interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXNAK</name>
            <description>NAK response received interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXTXACK</name>
            <description>ACK response received/transmitted interrupt</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TERR</name>
            <description>Transaction error</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BABBLE</name>
            <description>Babble error</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FOVR</name>
            <description>Frame overrun</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DTOG</name>
            <description>Data toggle error</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCHINT5</name>
        <displayName>HCHINT5</displayName>
        <description>OTG_FS host channel-5 interrupt register (OTG_FS_HCINT5)</description>
        <addressOffset>0x1A8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFCMPN</name>
            <description>Transfer completed</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>TSFCMPAN</name>
            <description>Channel halted</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXSTALL</name>
            <description>STALL response received interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXNAK</name>
            <description>NAK response received interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXTXACK</name>
            <description>ACK response received/transmitted interrupt</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TERR</name>
            <description>Transaction error</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BABBLE</name>
            <description>Babble error</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FOVR</name>
            <description>Frame overrun</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DTOG</name>
            <description>Data toggle error</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCHINT6</name>
        <displayName>HCHINT6</displayName>
        <description>OTG_FS host channel-6 interrupt register (OTG_FS_HCINT6)</description>
        <addressOffset>0x1C8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFCMPN</name>
            <description>Transfer completed</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>TSFCMPAN</name>
            <description>Channel halted</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXSTALL</name>
            <description>STALL response received interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXNAK</name>
            <description>NAK response received interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXTXACK</name>
            <description>ACK response received/transmitted interrupt</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TERR</name>
            <description>Transaction error</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BABBLE</name>
            <description>Babble error</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FOVR</name>
            <description>Frame overrun</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DTOG</name>
            <description>Data toggle error</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCHINT7</name>
        <displayName>HCHINT7</displayName>
        <description>OTG_FS host channel-7 interrupt register (OTG_FS_HCINT7)</description>
        <addressOffset>0x1E8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFCMPN</name>
            <description>Transfer completed</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>TSFCMPAN</name>
            <description>Channel halted</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXSTALL</name>
            <description>STALL response received interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXNAK</name>
            <description>NAK response received interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXTXACK</name>
            <description>ACK response received/transmitted interrupt</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TERR</name>
            <description>Transaction error</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BABBLE</name>
            <description>Babble error</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FOVR</name>
            <description>Frame overrun</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DTOG</name>
            <description>Data toggle error</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCHTSIZE0</name>
        <displayName>HCHTSIZE0</displayName>
        <description>OTG_FS host channel-0 transfer size register</description>
        <addressOffset>0x110</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFSIZE</name>
            <description>Transfer size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
        <field>
            <name>PCKTCNT</name>
            <description>Packet count</description>
            <bitOffset>19</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          <field>
            <name>DATAPID</name>
            <description>Data PID</description>
            <bitOffset>29</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCHTSIZE1</name>
        <displayName>HCHTSIZE1</displayName>
        <description>OTG_FS host channel-1 transfer size register</description>
        <addressOffset>0x130</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFSIZE</name>
            <description>Transfer size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
        <field>
            <name>PCKTCNT</name>
            <description>Packet count</description>
            <bitOffset>19</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          <field>
            <name>DATAPID</name>
            <description>Data PID</description>
            <bitOffset>29</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCHTSIZE2</name>
        <displayName>HCHTSIZE2</displayName>
        <description>OTG_FS host channel-2 transfer size register</description>
        <addressOffset>0x150</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFSIZE</name>
            <description>Transfer size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
        <field>
            <name>PCKTCNT</name>
            <description>Packet count</description>
            <bitOffset>19</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          <field>
            <name>DATAPID</name>
            <description>Data PID</description>
            <bitOffset>29</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCHTSIZE3</name>
        <displayName>HCHTSIZE3</displayName>
        <description>OTG_FS host channel-3 transfer size register</description>
        <addressOffset>0x170</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFSIZE</name>
            <description>Transfer size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
        <field>
            <name>PCKTCNT</name>
            <description>Packet count</description>
            <bitOffset>19</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          <field>
            <name>DATAPID</name>
            <description>Data PID</description>
            <bitOffset>29</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCHTSIZE4</name>
        <displayName>HCHTSIZE4</displayName>
        <description>OTG_FS host channel-x transfer size register</description>
        <addressOffset>0x190</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFSIZE</name>
            <description>Transfer size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
        <field>
            <name>PCKTCNT</name>
            <description>Packet count</description>
            <bitOffset>19</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          <field>
            <name>DATAPID</name>
            <description>Data PID</description>
            <bitOffset>29</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCHTSIZE5</name>
        <displayName>HCHTSIZE5</displayName>
        <description>OTG_FS host channel-5 transfer size register</description>
        <addressOffset>0x1B0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFSIZE</name>
            <description>Transfer size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
        <field>
            <name>PCKTCNT</name>
            <description>Packet count</description>
            <bitOffset>19</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          <field>
            <name>DATAPID</name>
            <description>Data PID</description>
            <bitOffset>29</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HCHTSIZE6</name>
        <displayName>HCHTSIZE6</displayName>
        <description>OTG_FS host channel-6 transfer size register</description>
        <addressOffset>0x1D0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFSIZE</name>
            <description>Transfer size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
        <field>
            <name>PCKTCNT</name>
            <description>Packet count</description>
            <bitOffset>19</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          <field>
            <name>DATAPID</name>
            <description>Data PID</description>
            <bitOffset>29</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
