Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>HCHTSIZE7</name>
        <displayName>HCHTSIZE7</displayName>
        <description>OTG_FS host channel-7 transfer size register</description>
        <addressOffset>0x1F0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TSFSIZE</name>
            <description>Transfer size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
        <field>
            <name>PCKTCNT</name>
            <description>Packet count</description>
            <bitOffset>19</bitOffset>
            <bitWidth>10</bitWidth>
          </field>
          <field>
            <name>DATAPID</name>
            <description>Data PID</description>
            <bitOffset>29</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>HFIFM</name>
        <displayName>HFIFM</displayName>
        <description>OTG_FS host frame number/frame time remaining register (OTG_FS_HFNUM)</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x3FFF</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FNUM</name>
            <description>Frame number</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>FRTIME</name>
            <description>Frame time remaining</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HFIVL</name>
        <displayName>HFIVL</displayName>
        <description>OTG_FS Host frame interval register</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xEA60</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FIVL</name>
            <description>Frame interval</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HPORTCSTS</name>
        <displayName>HPORTCSTS</displayName>
        <description>OTG_FS host port control and status register (OTG_FS_HPRT)</description>
        <addressOffset>0x40</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PCNNTFLG</name>
            <description>Port connect status</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PCINTFLG</name>
            <description>Port connect detected</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PEN</name>
            <description>Port enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PENCHG</name>
            <description>Port enable/disable change</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>POVC</name>
            <description>Port overcurrent active</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>POVCCHG</name>
            <description>Port overcurrent change</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PRS</name>
            <description>Port resume</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PSUS</name>
            <description>Port suspend</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PRST</name>
            <description>Port reset</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PDLSTS</name>
            <description>Port line status</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PP</name>
            <description>Port power</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PTSEL</name>
            <description>Port test control</description>
            <bitOffset>13</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>PSPDSEL</name>
            <description>Port speed</description>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          </fields>
      </register>
      <register>
        <name>HPTXSTS</name>
        <displayName>HPTXSTS</displayName>
        <description>OTG_FS_Host periodic transmit FIFO/queue status register (OTG_FS_HPTXSTS)</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x80100</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>FSPACE</name>
            <description>Periodic transmit data FIFO space available</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>QSPACE</name>
            <description>Periodic transmit request queue space available</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>QTOP</name>
            <description>Top of the periodic transmit request queue</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
