Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OTG_FS_PWRCLK</name>
      <description>USB on the go full speed</description>
      <groupName>USB_OTG_FS</groupName>
      <baseAddress>0x50000E00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>FS_PCGCCTL</name>
        <displayName>FS_PCGCCTL</displayName>
        <description>OTG_FS power and clock gating control register</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PCLKSTOP</name>
            <description>Stop PHY clock</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GCLK</name>
            <description>Gate HCLK</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PHYSUS</name>
            <description>PHY Suspended</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PMU</name>
      <description>Power control</description>
      <groupName>PMU</groupName>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>PVD</name>
        <description>PVD through EINT line 16 detection interrupt</description>
        <value>1</value>
      </interrupt>
      <registers>
      <register>
        <name>CSTS</name>
        <displayName>CSTS</displayName>
        <description>power control/status register</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>WUEFLG</name>
            <description>Wakeup flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        <field>
            <name>SBFLG</name>
            <description>Standby flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PVDOFLG</name>
            <description>PVD output</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>BKPRFLG</name>
            <description>Backup regulator ready</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>WKUPCFG</name>
            <description>Enable WKUP pin</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BKPREN</name>
            <description>Backup regulator enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>VOSRFLG</name>
            <description>Regulator voltage scaling output selection ready bit</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>CTRL</name>
        <displayName>CTRL</displayName>
        <description>power control register</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x8000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>LPDSCFG</name>
            <description>Low-power deep sleep</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PDDSCFG</name>
            <description>Power down deepsleep</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WUFLGCLR</name>
            <description>Clear wakeup flag</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>SBFLGCLR</name>
            <description>Clear standby flag</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PVDEN</name>
            <description>Power voltage detector enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PLSEL</name>
            <description>PVD level selection</description>
            <bitOffset>5</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>BPWEN</name>
            <description>Backup Domain Write Access Enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FPDSM</name>
            <description>Flash power down in Stop mode</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LPRLV</name>
            <description>Low Power Regulator Low Voltage in Stop Mode</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MRLV</name>
            <description>Main Regulator Low Voltage in Stop Mode</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC01EN</name>
            <description>ADC Option 1 Enable</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>VOSSEL</name>
            <description>Regulator Voltage Scaling Output Selection</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>FSMODE</name>
            <description>Force Flash Sleep Mode</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FLASHEN</name>
            <description>Flash Interface Enable</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
