Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>BDCTRL</name>
        <displayName>BDCTRL</displayName>
        <description>Backup domain control register</description>
        <addressOffset>0x70</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>LSEEN</name>
            <description>External low-speed oscillator enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LSERDYFLG</name>
            <description>External low-speed oscillator ready</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>LSEBCFG</name>
            <description>External low-speed oscillator bypass</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LSESEL</name>
            <description>Low-Speed External Clock Bypass Mode Configure</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RTCSRCSEL</name>
            <description>RTC clock source selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>RTCCLKEN</name>
            <description>RTC clock enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BDRST</name>
            <description>Backup domain software reset</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>CFG</name>
        <displayName>CFG</displayName>
        <description>clock configuration register</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SCLKSEL</name>
            <description>System clock switch</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCLKSELSTS</name>
            <description>System clock switch status</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>AHBPSC</name>
            <description>AHB prescaler</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SDRAMPSC</name>
            <description>SDRAM Clock Prescaler Factor Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>APB1PSC</name>
            <description>APB Low speed prescaler (APB1)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>APB2PSC</name>
            <description>APB high-speed prescaler (APB2)</description>
            <bitOffset>13</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RTCPSC</name>
            <description>HSE division factor for RTC clock</description>
            <bitOffset>16</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MCO1SEL</name>
            <description>Microcontroller clock output 1</description>
            <bitOffset>21</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>I2SSEL</name>
            <description>I2S clock selection</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MCO1PSC</name>
            <description>MCO1 prescaler</description>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MCO2PSC</name>
            <description>MCO2 prescaler</description>
            <bitOffset>27</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MCO2SEL</name>
            <description>Microcontroller clock output 2</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>CFGSEL</name>
        <displayName>CFGSEL</displayName>
        <description>clock configuration register</description>
        <addressOffset>0x8C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CLKPSEL</name>
            <description>Clock Prescaler Select</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSTS</name>
        <displayName>CSTS</displayName>
        <description>clock control &amp; status register</description>
        <addressOffset>0x74</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0xE000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>LSIEN</name>
            <description>Internal low-speed oscillator enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LSIRDYFLG</name>
            <description>Internal low-speed oscillator ready</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RSTFLGCLR</name>
            <description>Remove reset flag</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BORRSTFLG</name>
            <description>BOR reset flag</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PINRSTFLG</name>
            <description>PIN reset flag</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PODRSTFLG</name>
            <description>POR/PDR reset flag</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SWRSTFLG</name>
            <description>Software reset flag</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IWDTRSTFLG</name>
            <description>Independent watchdog reset flag</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WWDTRSTFLG</name>
            <description>Window watchdog reset flag</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>LPWRRSTFLG</name>
            <description>Low-power reset flag</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
      </register>
      <register>
        <name>CTRL</name>
        <displayName>CTRL</displayName>
        <description>clock control register</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x81</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>HSIEN</name>
            <description>Internal high-speed clock enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HSIRDYFLG</name>
            <description>Internal high-speed clock ready flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HSITRM</name>
            <description>Internal high-speed clock trimming</description>
            <bitOffset>3</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HSICAL</name>
            <description>Internal high-speed clock calibration</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HSEEN</name>
            <description>HSE clock enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HSERDYFLG</name>
            <description>HSE clock ready flag</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HSEBCFG</name>
            <description>HSE clock bypass</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CSSEN</name>
            <description>Clock security system enable</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PLL1EN</name>
            <description>Main PLL (PLL) enable</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PLL1RDYFLG</name>
            <description>Main PLL (PLL) clock ready flag</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PLL2EN</name>
            <description>PLLI2S enable</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PLL2RDYFLG</name>
            <description>PLLI2S clock ready flag</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INT</name>
        <displayName>INT</displayName>
        <description>clock interrupt register</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>LSIRDYFLG</name>
            <description>LSI ready interrupt flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>LSERDYFLG</name>
            <description>LSE ready interrupt flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HSIRDYFLG</name>
            <description>HSI ready interrupt flag</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HSERDYFLG</name>
            <description>HSE ready interrupt flag</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PLL1RDYFLG</name>
            <description>Main PLL (PLL) ready interrupt flag</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PLL2RDYFLG</name>
            <description>PLLI2S ready interrupt flag</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        <field>
            <name>CSSFLG</name>
            <description>Clock security system interrupt flag</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>LSIRDYEN</name>
            <description>LSI ready interrupt enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LSERDYEN</name>
            <description>LSE ready interrupt enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HSIRDYEN</name>
            <description>HSI ready interrupt enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HSERDYEN</name>
            <description>HSE ready interrupt enable</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PLL1RDYEN</name>
            <description>Main PLL (PLL) ready interrupt enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PLL2RDYEN</name>
            <description>PLLI2S ready interrupt enable</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LSIRDYCLR</name>
            <description>LSI ready interrupt clear</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>LSERDYCLR</name>
            <description>LSE ready interrupt clear</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>HSIRDYCLR</name>
            <description>HSI ready interrupt clear</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>HSERDYCLR</name>
            <description>HSE ready interrupt clear</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>PLL1RDYCLR</name>
            <description>Main PLL(PLL) ready interrupt clear</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>PLL2RDYCLR</name>
            <description>PLLI2S ready interrupt clear</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>CSSCLR</name>
            <description>Clock security system interrupt clear</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          </fields>
      </register>
      <register>
        <name>LPAHB1CLKEN</name>
        <displayName>LPAHB1CLKEN</displayName>
        <description>AHB1 peripheral clock enable in low power mode register</description>
        <addressOffset>0x50</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x61900F</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PAEN</name>
            <description>IO port A clock enable during sleep mode</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PBEN</name>
            <description>IO port B clock enable during Sleep mode</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PCEN</name>
            <description>IO port C clock enable during Sleep mode</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PDEN</name>
            <description>IO port D clock enable during Sleep mode</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PEEN</name>
            <description>IO port E clock enable during Sleep mode</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PHEN</name>
            <description>IO port H clock enable during Sleep mode</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRCEN</name>
            <description>CRC clock enable during Sleep mode</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FMCEN</name>
            <description>Flash interface clock enable during Sleep mode</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SRAM1EN</name>
            <description>SRAM 1interface clock enable during Sleep mode</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>DMA1EN</name>
            <description>DMA1 clock enable during Sleep mode</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMA2EN</name>
            <description>DMA2 clock enable during Sleep mode</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>LPAHB2CLKEN</name>
        <displayName>LPAHB2CLKEN</displayName>
        <description>AHB2 peripheral clock enable in low power mode register</description>
        <addressOffset>0x54</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x80</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>QSPIEN</name>
            <description>QSPI enable during Sleep mode</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RNGEN</name>
            <description>Random number generator clock enable during Sleep mode</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>OTGFSEN</name>
            <description>USB OTG FS clock enable during Sleep mode</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>LPAHB3CLKEN</name>
        <displayName>LPAHB3CLKEN</displayName>
        <description>AHB3 peripheral clock enable in low power mode register</description>
        <addressOffset>0x58</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SMCEN</name>
            <description>Flexible static memory controller module clock enable during Sleep mode</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
