Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>LPAPB1CLKEN</name>
        <displayName>LPAPB1CLKEN</displayName>
        <description>APB1 peripheral clock enable in low power mode register</description>
        <addressOffset>0x60</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x10E2C80F</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TMR2EN</name>
            <description>TMR2 clock enable during Sleep mode</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR3EN</name>
            <description>TMR3 clock enable during Sleep mode</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR4EN</name>
            <description>TMR4 clock enable during Sleep mode</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR5EN</name>
            <description>TMR5 clock enable during Sleep mode</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR12EN</name>
            <description>TMR12 clock enable during Sleep mode</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR13EN</name>
            <description>TMR13 clock enable during Sleep mode</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR14EN</name>
            <description>TMR14 clock enable during Sleep mode</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WWDTEN</name>
            <description>Window watchdog clock enable during Sleep mode</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>SPI2EN</name>
            <description>SPI2 clock enable during Sleep mode</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPI3EN</name>
            <description>SPI3 clock enable during Sleep mode</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>USART2EN</name>
            <description>USART2 clock enable during Sleep mode</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>USART3EN</name>
            <description>USART3 clock enable during Sleep mode</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UART4EN</name>
            <description>UART4 clock enable during Sleep mode</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UART5EN</name>
            <description>UART5 clock enable during Sleep mode</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>I2C1EN</name>
            <description>I2C1 clock enable during Sleep mode</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>I2C2EN</name>
            <description>I2C2 clock enable during Sleep mode</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>I2C3EN</name>
            <description>I2C3 clock enable during Sleep mode</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CAN1EN</name>
            <description>CAN 1 clock enable during Sleep mode</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CAN2EN</name>
            <description>CAN 2 clock enable during Sleep mode</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PWUEN</name>
            <description>Power interface clock enable during Sleep mode</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>LPAPB2CLKEN</name>
        <displayName>LPAPB2CLKEN</displayName>
        <description>APB2 peripheral clock enabled in low power mode register</description>
        <addressOffset>0x64</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x77930</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>TMR1EN</name>
            <description>TMR1 clock enable during Sleep mode</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR8EN</name>
            <description>TMR8 clock enable during Sleep mode</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>USART1EN</name>
            <description>USART1 clock enable during Sleep mode</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>USART6EN</name>
            <description>USART6 clock enable during Sleep mode</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>ADC1EN</name>
            <description>ADC1 clock enable during Sleep mode</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC2EN</name>
            <description>ADC2 clock enable during Sleep mode</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC3EN</name>
            <description>ADC 3 clock enable during Sleep mode</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SDIOEN</name>
            <description>SDIO clock enable during Sleep mode</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPI1EN</name>
            <description>SPI 1 clock enable during Sleep mode</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPI4EN</name>
            <description>SPI 4 clock enable during Sleep mode</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SYSCFGEN</name>
            <description>System configuration controller clock enable during Sleep mode</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR9EN</name>
            <description>TMR9 clock enable during sleep mode</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR10EN</name>
            <description>TMR10 clock enable during Sleep mode</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TMR11EN</name>
            <description>TMR11 clock enable during Sleep mode</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SPI5EN</name>
            <description>SPI5 clock enable during Sleep mode</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>PLL1CFG</name>
        <displayName>PLL1CFG</displayName>
        <description>PLL configuration register</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x24003010</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PLLB</name>
            <description>Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>PLL1A</name>
            <description>Main PLL (PLL) multiplication factor for VCO</description>
            <bitOffset>6</bitOffset>
            <bitWidth>9</bitWidth>
          </field>
          <field>
            <name>PLL1C</name>
            <description>Main PLL (PLL) division factor for main system clock</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PLLCLKS</name>
            <description>Main PLL(PLL) and audio PLL (PLLI2S) entry clock source</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PLLD</name>
            <description>Main PLL (PLL) division factor for USB
 OTG FS, SDIO and random number generator clocks</description>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PLL2CFG</name>
        <displayName>PLL2CFG</displayName>
        <description>PLLI2S configuration register</description>
        <addressOffset>0x84</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x24003000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PLL2B</name>
            <description>PLLI2S division factor for VCO</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>PLL2A</name>
            <description>PLLI2S multiplication factor for VCO</description>
            <bitOffset>6</bitOffset>
            <bitWidth>9</bitWidth>
          </field>
          <field>
            <name>PLL2C</name>
            <description>PLLI2S division factor for I2S clocks</description>
            <bitOffset>28</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SSCCFG</name>
        <displayName>SSCCFG</displayName>
        <description>spread spectrum clock generation register</description>
        <addressOffset>0x80</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MODPCFG</name>
            <description>Modulation period</description>
            <bitOffset>0</bitOffset>
            <bitWidth>13</bitWidth>
          </field>
          <field>
            <name>STEP</name>
            <description>Incrementation step</description>
            <bitOffset>13</bitOffset>
            <bitWidth>15</bitWidth>
          </field>
        <field>
            <name>SSSEL</name>
            <description>Spread Select</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SSEN</name>
            <description>Spread spectrum modulation enable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
