Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>RES2</name>
        <displayName>RES2</displayName>
        <description>response 2 register</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CARDSTS2</name>
            <description>Card status</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RES3</name>
        <displayName>RES3</displayName>
        <description>response 3 register</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CARDSTS3</name>
            <description>Card status</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RES4</name>
        <displayName>RES4</displayName>
        <description>response 4 register</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CARDSTS4</name>
            <description>Card status</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>STS</name>
        <displayName>STS</displayName>
        <description>status register</description>
        <addressOffset>0x34</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>COMRESP</name>
            <description>Command response received (CRC check failed)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DBDR</name>
            <description>Data block sent/received (CRC check failed)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CMDRESTO</name>
            <description>Command response timeout</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DATATO</name>
            <description>Data timeout</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXUDRER</name>
            <description>Transmit FIFO underrun error</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>RXOVRER</name>
            <description>Received FIFO overrun error</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CMDRES</name>
            <description>Command response received (CRC check passed)</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CMDSENT</name>
            <description>Command sent (no response required)</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DATAEND</name>
            <description>Data end (data counter, SDIDCOUNT, is zero)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SBE</name>
            <description>Start bit not detected on all data signals in wide bus mode</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DBCP</name>
            <description>Data block sent/received (CRC check passed)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CMDACT</name>
            <description>Command transfer in progress</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXACT</name>
            <description>Data transmit in progress</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXACT</name>
            <description>Data receive in progress</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXFHF</name>
            <description>Transmit FIFO half empty: at least 8 words can be written into the FIFO</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXFHF</name>
            <description>Receive FIFO half full: there are at least 8 words in the FIFO</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXFF</name>
            <description>Transmit FIFO full</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXFF</name>
            <description>Receive FIFO full</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXFE</name>
            <description>Transmit FIFO empty</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXFE</name>
            <description>Receive FIFO empty</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXDA</name>
            <description>Data available in transmit FIFO</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXDA</name>
            <description>Data available in receive FIFO</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SDIOINT</name>
            <description>SDIO interrupt received</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ATAEND</name>
            <description>CE-ATA command completion signal received for CMD61</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
