Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SMC</name>
      <description>Static memory controller</description>
      <groupName>SMC</groupName>
      <baseAddress>0xA0000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>SMC</name>
        <description>SMC global interrupt</description>
        <value>48</value>
      </interrupt>
      <registers>
      <register>
        <name>AMSTIM2</name>
        <displayName>AMSTIM2</displayName>
        <description>Attribute memory space timing register 2</description>
        <addressOffset>0x6C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFCFCFCFC</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SETx</name>
            <description>Attribute Memory x Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>WAITx</name>
            <description>Attribute Memory x Wait Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>HLDx</name>
            <description>Attribute Memory x Hold Time Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>HIZx</name>
            <description>Attribute Memory x Databus Hiz Time Configure</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>AMSTIM3</name>
        <displayName>AMSTIM3</displayName>
        <description>Attribute memory space timing register 3</description>
        <addressOffset>0x8C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFCFCFCFC</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SETx</name>
            <description>Attribute Memory x Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>WAITx</name>
            <description>Attribute Memory x Wait Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>HLDx</name>
            <description>Attribute Memory x Hold Time Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>HIZx</name>
            <description>Attribute Memory x Databus Hiz Time Configure</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>AMSTIM4</name>
        <displayName>AMSTIM4</displayName>
        <description>Attribute memory space timing register 4</description>
        <addressOffset>0xAC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFCFCFCFC</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SETx</name>
            <description>Attribute Memory x Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>WAITx</name>
            <description>Attribute Memory x Wait Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>HLDx</name>
            <description>Attribute Memory x Hold Time Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>HIZx</name>
            <description>Attribute Memory x Databus Hiz Time Configure</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CMSTIM2</name>
        <displayName>CMSTIM2</displayName>
        <description>Common memory space timing register 2</description>
        <addressOffset>0x68</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFCFCFCFC</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SETx</name>
            <description>Common Memory x Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>WAITx</name>
            <description>Common Memory x Wait Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>HLDx</name>
            <description>Common Memory x Hold Time Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>HIZx</name>
            <description>Common Memory x Databus Hiz Time Configure</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CMSTIM3</name>
        <displayName>CMSTIM3</displayName>
        <description>Common memory space timing register 3</description>
        <addressOffset>0x88</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFCFCFCFC</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SETx</name>
            <description>Common Memory x Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>WAITx</name>
            <description>Common Memory x Wait Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>HLDx</name>
            <description>Common Memory x Hold Time Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>HIZx</name>
            <description>Common Memory x Databus Hiz Time Configure</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CMSTIM4</name>
        <displayName>CMSTIM4</displayName>
        <description>Common memory space timing register 4</description>
        <addressOffset>0xA8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFCFCFCFC</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SETx</name>
            <description>Common Memory x Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>WAITx</name>
            <description>Common Memory x Wait Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>HLDx</name>
            <description>Common Memory x Hold Time Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>HIZx</name>
            <description>Common Memory x Databus Hiz Time Configure</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CSCTRL1</name>
        <displayName>CSCTRL1</displayName>
        <description>SRAM/NOR-Flash chip-select control register 1</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x30D0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MBKEN</name>
            <description>Enable the Corresponding Memory Bank</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADMUXEN</name>
            <description>Address/Data Multiplexing Enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MTYPECFG</name>
            <description>Memory Type Configure</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MDBWIDCFG</name>
            <description>Memory Data Bus Width Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NORFMACCEN</name>
            <description>NORFlash Memory Access Enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BURSTEN</name>
            <description>Burst Mode Enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WSPOLCFG</name>
            <description>Wait Signal Polarity Configure</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WRAPBEN</name>
            <description>Wrapped Burst Mode Enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WTIMCFG</name>
            <description>Wait Timing Configure</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>WREN</name>
            <description>Write Memory Enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WAITEN</name>
            <description>Wait Enable</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EXTMODEEN</name>
            <description>Extended Mode Enable</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WSASYNCEN</name>
            <description>Wait Signal During Asynchronous Transfers Enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRAMPSIZECFG</name>
            <description>CRAM Page Size Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>WRBURSTEN</name>
            <description>Write PSRAM Burst Enable</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CSCTRL2</name>
        <displayName>CSCTRL2</displayName>
        <description>SRAM/NOR-Flash chip-select control register 2</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x30D0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MBKEN</name>
            <description>Enable the Corresponding Memory Bank</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADMUXEN</name>
            <description>Address/Data Multiplexing Enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MTYPECFG</name>
            <description>Memory Type Configure</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MDBWIDCFG</name>
            <description>Memory Data Bus Width Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NORFMACCEN</name>
            <description>NORFlash Memory Access Enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BURSTEN</name>
            <description>Burst Mode Enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WSPOLCFG</name>
            <description>Wait Signal Polarity Configure</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WRAPBEN</name>
            <description>Wrapped Burst Mode Enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WTIMCFG</name>
            <description>Wait Timing Configure</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>WREN</name>
            <description>Write Memory Enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WAITEN</name>
            <description>Wait Enable</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EXTMODEEN</name>
            <description>Extended Mode Enable</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WSASYNCEN</name>
            <description>Wait Signal During Asynchronous Transfers Enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRAMPSIZECFG</name>
            <description>CRAM Page Size Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>WRBURSTEN</name>
            <description>Write PSRAM Burst Enable</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CSCTRL3</name>
        <displayName>CSCTRL3</displayName>
        <description>SRAM/NOR-Flash chip-select control register 3</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x30D0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MBKEN</name>
            <description>Enable the Corresponding Memory Bank</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADMUXEN</name>
            <description>Address/Data Multiplexing Enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MTYPECFG</name>
            <description>Memory Type Configure</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MDBWIDCFG</name>
            <description>Memory Data Bus Width Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NORFMACCEN</name>
            <description>NORFlash Memory Access Enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BURSTEN</name>
            <description>Burst Mode Enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WSPOLCFG</name>
            <description>Wait Signal Polarity Configure</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WRAPBEN</name>
            <description>Wrapped Burst Mode Enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WTIMCFG</name>
            <description>Wait Timing Configure</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>WREN</name>
            <description>Write Memory Enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WAITEN</name>
            <description>Wait Enable</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EXTMODEEN</name>
            <description>Extended Mode Enable</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WSASYNCEN</name>
            <description>Wait Signal During Asynchronous Transfers Enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRAMPSIZECFG</name>
            <description>CRAM Page Size Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>WRBURSTEN</name>
            <description>Write PSRAM Burst Enable</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CSCTRL4</name>
        <displayName>CSCTRL4</displayName>
        <description>SRAM/NOR-Flash chip-select control register 4</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x30D0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>MBKEN</name>
            <description>Enable the Corresponding Memory Bank</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADMUXEN</name>
            <description>Address/Data Multiplexing Enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MTYPECFG</name>
            <description>Memory Type Configure</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MDBWIDCFG</name>
            <description>Memory Data Bus Width Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NORFMACCEN</name>
            <description>NORFlash Memory Access Enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BURSTEN</name>
            <description>Burst Mode Enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WSPOLCFG</name>
            <description>Wait Signal Polarity Configure</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WRAPBEN</name>
            <description>Wrapped Burst Mode Enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WTIMCFG</name>
            <description>Wait Timing Configure</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>WREN</name>
            <description>Write Memory Enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WAITEN</name>
            <description>Wait Enable</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EXTMODEEN</name>
            <description>Extended Mode Enable</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WSASYNCEN</name>
            <description>Wait Signal During Asynchronous Transfers Enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRAMPSIZECFG</name>
            <description>CRAM Page Size Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>WRBURSTEN</name>
            <description>Write PSRAM Burst Enable</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
