Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>CSTIM1</name>
        <displayName>CSTIM1</displayName>
        <description>SRAM/NOR-Flash chip-select timing register 1</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFFFFFFFF</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ADDRSETCFG</name>
            <description>Address Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ADDRHLDCFG</name>
            <description>Address-Hold Time Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATASETCFG</name>
            <description>Data Setup Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>BUSTURNCFG</name>
            <description>Bus Turnaround Phase Duration Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CLKDIVCFG</name>
            <description>Clock Divide Factor Configure</description>
            <bitOffset>20</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATALATCFG</name>
            <description>Data Latency Configure</description>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ASYNCACCCFG</name>
            <description>Asynchronous Access Mode Configure</description>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CSTIM2</name>
        <displayName>CSTIM2</displayName>
        <description>SRAM/NOR-Flash chip-select timing register 2</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFFFFFFFF</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ADDRSETCFG</name>
            <description>Address Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ADDRHLDCFG</name>
            <description>Address-Hold Time Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATASETCFG</name>
            <description>Data Setup Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>BUSTURNCFG</name>
            <description>Bus Turnaround Phase Duration Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CLKDIVCFG</name>
            <description>Clock Divide Factor Configure</description>
            <bitOffset>20</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATALATCFG</name>
            <description>Data Latency Configure</description>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ASYNCACCCFG</name>
            <description>Asynchronous Access Mode Configure</description>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CSTIM3</name>
        <displayName>CSTIM3</displayName>
        <description>SRAM/NOR-Flash chip-select timing register 3</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFFFFFFFF</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ADDRSETCFG</name>
            <description>Address Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ADDRHLDCFG</name>
            <description>Address-Hold Time Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATASETCFG</name>
            <description>Data Setup Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>BUSTURNCFG</name>
            <description>Bus Turnaround Phase Duration Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CLKDIVCFG</name>
            <description>Clock Divide Factor Configure</description>
            <bitOffset>20</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATALATCFG</name>
            <description>Data Latency Configure</description>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ASYNCACCCFG</name>
            <description>Asynchronous Access Mode Configure</description>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CSTIM4</name>
        <displayName>CSTIM4</displayName>
        <description>SRAM/NOR-Flash chip-select timing register 4</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFFFFFFFF</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ADDRSETCFG</name>
            <description>Address Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ADDRHLDCFG</name>
            <description>Address-Hold Time Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATASETCFG</name>
            <description>Data Setup Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>BUSTURNCFG</name>
            <description>Bus Turnaround Phase Duration Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CLKDIVCFG</name>
            <description>Clock Divide Factor Configure</description>
            <bitOffset>20</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATALATCFG</name>
            <description>Data Latency Configure</description>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ASYNCACCCFG</name>
            <description>Asynchronous Access Mode Configure</description>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CTRL2</name>
        <displayName>CTRL2</displayName>
        <description>PC Card/NAND Flash control register 2</description>
        <addressOffset>0x60</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x18</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>WAITFEN</name>
            <description>PC Card/NANDFlash Wait Feature Enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>MBKEN</name>
            <description>PC Card/NAND Flash Memory Bank Enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MTYPECFG</name>
            <description>Memory Type Configure</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DBWIDCFG</name>
            <description>Databus Width Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>ECCEN</name>
            <description>ECC Computation Logic Enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>C2RDCFG</name>
            <description>CLE To RE Delay Configure</description>
            <bitOffset>9</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>A2RDCFG</name>
            <description>ALE To RE Delay Configure</description>
            <bitOffset>13</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ECCPSCFG</name>
            <description>ECC Page Size Configure</description>
            <bitOffset>17</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CTRL3</name>
        <displayName>CTRL3</displayName>
        <description>PC Card/NAND Flash control register 3</description>
        <addressOffset>0x80</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x18</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>WAITFEN</name>
            <description>PC Card/NANDFlash Wait Feature Enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>MBKEN</name>
            <description>PC Card/NAND Flash Memory Bank Enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MTYPECFG</name>
            <description>Memory Type Configure</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DBWIDCFG</name>
            <description>Databus Width Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>ECCEN</name>
            <description>ECC Computation Logic Enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>C2RDCFG</name>
            <description>CLE To RE Delay Configure</description>
            <bitOffset>9</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>A2RDCFG</name>
            <description>ALE To RE Delay Configure</description>
            <bitOffset>13</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ECCPSCFG</name>
            <description>ECC Page Size Configure</description>
            <bitOffset>17</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CTRL4</name>
        <displayName>CTRL4</displayName>
        <description>PC Card/NAND Flash control register 4</description>
        <addressOffset>0xA0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x18</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>WAITFEN</name>
            <description>PC Card/NANDFlash Wait Feature Enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>MBKEN</name>
            <description>PC Card/NAND Flash Memory Bank Enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MTYPECFG</name>
            <description>Memory Type Configure</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DBWIDCFG</name>
            <description>Databus Width Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>ECCEN</name>
            <description>ECC Computation Logic Enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>C2RDCFG</name>
            <description>CLE To RE Delay Configure</description>
            <bitOffset>9</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>A2RDCFG</name>
            <description>ALE To RE Delay Configure</description>
            <bitOffset>13</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ECCPSCFG</name>
            <description>ECC Page Size Configure</description>
            <bitOffset>17</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>ECCRS2</name>
        <displayName>ECCRS2</displayName>
        <description>ECC result register 2</description>
        <addressOffset>0x74</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ECCRS</name>
            <description>ECC result</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ECCRS3</name>
        <displayName>ECCRS3</displayName>
        <description>ECC result register 3</description>
        <addressOffset>0x94</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ECCRS</name>
            <description>ECC result</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IOSTIM4</name>
        <displayName>IOSTIM4</displayName>
        <description>I/O space timing register 4</description>
        <addressOffset>0xB0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFCFCFCFC</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SET</name>
            <description>I/O x Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>WAIT</name>
            <description>I/O x Wait Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>HLD</name>
            <description>I/O x Hold Time Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>HIZ</name>
            <description>I/O x Databus Hiz Time Configure</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>STSINT2</name>
        <displayName>STSINT2</displayName>
        <description>FIFO status and interrupt register 2</description>
        <addressOffset>0x64</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x40</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>IREFLG</name>
            <description>Interrupt Rising Edge Generate Flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>IHLFLG</name>
            <description>Interrupt High-Level Generate Flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IFEFLG</name>
            <description>Interrupt Falling Edge Generate Flag</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IREDEN</name>
            <description>Interrupt Rising Edge Detection Enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IHLDEN</name>
            <description>Interrupt High-Level Detection Enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IFEDEN</name>
            <description>Interrupt Falling Edge Detection Enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FEFLG</name>
            <description>FIFO Empty Flag</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          </fields>
      </register>
      <register>
        <name>STSINT3</name>
        <displayName>STSINT3</displayName>
        <description>FIFO status and interrupt register 3</description>
        <addressOffset>0x84</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x40</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>IREFLG</name>
            <description>Interrupt Rising Edge Generate Flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>IHLFLG</name>
            <description>Interrupt High-Level Generate Flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IFEFLG</name>
            <description>Interrupt Falling Edge Generate Flag</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IREDEN</name>
            <description>Interrupt Rising Edge Detection Enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IHLDEN</name>
            <description>Interrupt High-Level Detection Enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IFEDEN</name>
            <description>Interrupt Falling Edge Detection Enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FEFLG</name>
            <description>FIFO Empty Flag</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          </fields>
      </register>
      <register>
        <name>STSINT4</name>
        <displayName>STSINT4</displayName>
        <description>FIFO status and interrupt register 4</description>
        <addressOffset>0xA4</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x40</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>IREFLG</name>
            <description>Interrupt Rising Edge Generate Flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        <field>
            <name>IHLFLG</name>
            <description>Interrupt High-Level Generate Flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IFEFLG</name>
            <description>Interrupt Falling Edge Generate Flag</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IREDEN</name>
            <description>Interrupt Rising Edge Detection Enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IHLDEN</name>
            <description>Interrupt High-Level Detection Enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IFEDEN</name>
            <description>Interrupt Falling Edge Detection Enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FEFLG</name>
            <description>FIFO Empty Flag</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          </fields>
      </register>
