Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>WRTTIM1</name>
        <displayName>WRTTIM1</displayName>
        <description>SRAM/NOR-Flash write timing registers 1</description>
        <addressOffset>0x104</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFFFFFFF</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ADDRSETCFG</name>
            <description>Address Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ADDRHLDCFG</name>
            <description>Address-Hold Time Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATASETCFG</name>
            <description>Data-Setup Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>BUSTURNCFG</name>
            <description>Bus Turnaround Phase Duration Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ASYNCACCCFG</name>
            <description>Asynchronous Access Mode Configure</description>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>WRTTIM2</name>
        <displayName>WRTTIM2</displayName>
        <description>SRAM/NOR-Flash write timing registers 2</description>
        <addressOffset>0x10C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFFFFFFF</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ADDRSETCFG</name>
            <description>Address Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ADDRHLDCFG</name>
            <description>Address-Hold Time Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATASETCFG</name>
            <description>Data-Setup Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>BUSTURNCFG</name>
            <description>Bus Turnaround Phase Duration Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ASYNCACCCFG</name>
            <description>Asynchronous Access Mode Configure</description>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>WRTTIM3</name>
        <displayName>WRTTIM3</displayName>
        <description>SRAM/NOR-Flash write timing registers 3</description>
        <addressOffset>0x114</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFFFFFFF</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ADDRSETCFG</name>
            <description>Address Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ADDRHLDCFG</name>
            <description>Address-Hold Time Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATASETCFG</name>
            <description>Data-Setup Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>BUSTURNCFG</name>
            <description>Bus Turnaround Phase Duration Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ASYNCACCCFG</name>
            <description>Asynchronous Access Mode Configure</description>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>WRTTIM4</name>
        <displayName>WRTTIM4</displayName>
        <description>SRAM/NOR-Flash write timing registers 4</description>
        <addressOffset>0x11C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFFFFFFF</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ADDRSETCFG</name>
            <description>Address Setup Time Configure</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ADDRHLDCFG</name>
            <description>Address-Hold Time Configure</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATASETCFG</name>
            <description>Data-Setup Time Configure</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        <field>
            <name>BUSTURNCFG</name>
            <description>Bus Turnaround Phase Duration Configure</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ASYNCACCCFG</name>
            <description>Asynchronous Access Mode Configure</description>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
