Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TMR2</name>
      <description>General purpose timers</description>
      <groupName>TMR</groupName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>TMR2</name>
        <description>TMR2 global interrupt</description>
        <value>28</value>
      </interrupt>
      <registers>
      <register>
        <name>AUTORLD</name>
        <displayName>AUTORLD</displayName>
        <description>auto-reload register</description>
        <addressOffset>0x2C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFFFFFFFF</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>AUTORLD</name>
            <description>Auto Reload Value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CC1</name>
        <displayName>CC1</displayName>
        <description>capture/compare register 1</description>
        <addressOffset>0x34</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC1_L</name>
            <description>Low Capture/Compare 1 value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        <field>
            <name>CC1_H</name>
            <description>High Capture/Compare 1 value</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CC2</name>
        <displayName>CC2</displayName>
        <description>capture/compare register 2</description>
        <addressOffset>0x38</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC2_L</name>
            <description>Low Capture/Compare 2 value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        <field>
            <name>CC2_H</name>
            <description>High Capture/Compare 2 value</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CC3</name>
        <displayName>CC3</displayName>
        <description>capture/compare register 3</description>
        <addressOffset>0x3C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC3_L</name>
            <description>Low Capture/Compare value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        <field>
            <name>CC3_H</name>
            <description>High Capture/Compare value</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CC4</name>
        <displayName>CC4</displayName>
        <description>capture/compare register 4</description>
        <addressOffset>0x40</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC4_L</name>
            <description>Low Capture/Compare value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        <field>
            <name>CC4_H</name>
            <description>High Capture/Compare value</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CCEN</name>
        <displayName>CCEN</displayName>
        <description>capture/compare enable register</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC1EN</name>
            <description>Capture/Compare 1 output enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC1POL</name>
            <description>Capture/Compare 1 output Polarity</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC1NPOL</name>
            <description>Capture/Compare 1 output Polarity</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2EN</name>
            <description>Capture/Compare 2 output enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2POL</name>
            <description>Capture/Compare 2 output Polarity</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2NPOL</name>
            <description>Capture/Compare 2 output Polarity</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3EN</name>
            <description>Capture/Compare 3 output enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3POL</name>
            <description>Capture/Compare 3 output Polarity</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3NPOL</name>
            <description>Capture/Compare 3 output Polarity</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4EN</name>
            <description>Capture/Compare 4 output enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4POL</name>
            <description>Capture/Compare 3 output Polarity</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CC4NPOL</name>
            <description>Capture/Compare 4 output Polarity</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CCM1_CAPTURE</name>
        <displayName>CCM1_CAPTURE</displayName>
        <description>capture/compare mode register 1 (input mode)</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC1SEL</name>
            <description>Capture/Compare 1 selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>IC1PSC</name>
            <description>Input capture 1 prescaler</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>IC1F</name>
            <description>Input capture 1 filter</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CC2SEL</name>
            <description>Capture/Compare 2 selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>IC2PSC</name>
            <description>Input capture 2 prescaler</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        <field>
            <name>IC2F</name>
            <description>Input capture 2 filter</description>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CCM1_COMPARE</name>
        <displayName>CCM1_COMPARE</displayName>
        <description>capture/compare mode register 1 (output mode)</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC1SEL</name>
            <description>Capture/Compare 1 selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OC1FEN</name>
            <description>Output Compare 1 fast enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC1PEN</name>
            <description>Output Compare 1 preload enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC1MOD</name>
            <description>Output Compare 1 mode</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>OC1CEN</name>
            <description>Output Compare 1 clear enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2SEL</name>
            <description>Capture/Compare 2 selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OC2FEN</name>
            <description>Output Compare 2 fast enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC2PEN</name>
            <description>Output Compare 2 preload enable</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>OC2MOD</name>
            <description>Output Compare 2 mode</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>OC2CEN</name>
            <description>Output Compare 2 clear enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CCM2_CAPTURE</name>
        <displayName>CCM2_CAPTURE</displayName>
        <description>capture/compare mode register 2 (input mode)</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC3SEL</name>
            <description>Capture/compare 3 selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>IC3PSC</name>
            <description>Input capture 3 prescaler</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>IC3F</name>
            <description>Input capture 3 filter</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CC4SEL</name>
            <description>Capture/Compare 4 selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>IC4PSC</name>
            <description>Input capture 4 prescaler</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        <field>
            <name>IC4F</name>
            <description>Input capture 4 filter</description>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CCM2_COMPARE</name>
        <displayName>CCM2_COMPARE</displayName>
        <description>capture/compare mode register 2 (output mode)</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC3SEL</name>
            <description>Capture/Compare 3 selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OC3FEN</name>
            <description>Output compare 3 fast enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC3PEN</name>
            <description>Output compare 3 preload enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC3MOD</name>
            <description>Output compare 3 mode</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>OC3CEN</name>
            <description>Output compare 3 clear enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4SEL</name>
            <description>Capture/Compare 4 selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OC4FEN</name>
            <description>Output compare 4 fast enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC4PEN</name>
            <description>Output compare 4 preload enable</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>OC4MOD</name>
            <description>Output compare 4 mode</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>OC4CEN</name>
            <description>Output compare 4 clear enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CFG</name>
        <displayName>CFG</displayName>
        <description>event generation register</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>write-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>UEG</name>
            <description>Update generation</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CC1EG</name>
            <description>Capture/compare 1 generation</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2EG</name>
            <description>Capture/compare 2 generation</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3EG</name>
            <description>Capture/compare 3 generation</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4EG</name>
            <description>Capture/compare 4 generation</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TEG</name>
            <description>Trigger generation</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CNT</name>
        <displayName>CNT</displayName>
        <description>counter</description>
        <addressOffset>0x24</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CNT</name>
            <description>Counter Value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTRL1</name>
        <displayName>CTRL1</displayName>
        <description>control register 1</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CNTEN</name>
            <description>Counter enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UD</name>
            <description>Update disable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>URSSEL</name>
            <description>Update request source</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>SPMEN</name>
            <description>One-pulse mode</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CNTDIR</name>
            <description>Direction</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CAMSEL</name>
            <description>Center-aligned mode selection</description>
            <bitOffset>5</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>ARPEN</name>
            <description>Auto-reload preload enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CLKDIV</name>
            <description>Clock division</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CTRL2</name>
        <displayName>CTRL2</displayName>
        <description>control register 2</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CCDSEL</name>
            <description>Capture/compare DMA selection</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MMSEL</name>
            <description>Master mode selection</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>TI1SEL</name>
            <description>TI1 selection</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DCTRL</name>
        <displayName>DCTRL</displayName>
        <description>DMA control register</description>
        <addressOffset>0x48</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DBADDR</name>
            <description>DMA base address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>DBLEN</name>
            <description>DMA burst length</description>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
