Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>CTRL2</name>
        <displayName>CTRL2</displayName>
        <description>control register 2</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CCPEN</name>
            <description>Capture/compare preloaded control</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CCUSEL</name>
            <description>Capture/compare control update selection</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CCDSEL</name>
            <description>Capture/compare DMA selection</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MMSEL</name>
            <description>Master mode selection</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>TI1SEL</name>
            <description>TI1 selection</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>OC1OIS</name>
            <description>Output Idle state 1</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC1NOIS</name>
            <description>Output Idle state 1</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC2OIS</name>
            <description>Output Idle state 2</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC2NOIS</name>
            <description>Output Idle state 2</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC3OIS</name>
            <description>Output Idle state 3</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC3NOIS</name>
            <description>Output Idle state 3</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC4OIS</name>
            <description>Output Idle state 4</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>DCTRL</name>
        <displayName>DCTRL</displayName>
        <description>DMA control register</description>
        <addressOffset>0x48</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DBADDR</name>
            <description>DMA base address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>DBLEN</name>
            <description>DMA burst length</description>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEN</name>
        <displayName>DIEN</displayName>
        <description>DMA/Interrupt enable register</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>UIEN</name>
            <description>Update interrupt enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CC1IEN</name>
            <description>Capture/Compare 1 interrupt enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2IEN</name>
            <description>Capture/Compare 2 interrupt enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3IEN</name>
            <description>Capture/Compare 3 interrupt enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4IEN</name>
            <description>Capture/Compare 4 interrupt enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>COMIEN</name>
            <description>COM interrupt enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRGIEN</name>
            <description>Trigger interrupt enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRKIEN</name>
            <description>Break interrupt enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UDIEN</name>
            <description>Update DMA request enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC1DEN</name>
            <description>Capture/Compare 1 DMA request enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2DEN</name>
            <description>Capture/Compare 2 DMA request enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3DEN</name>
            <description>Capture/Compare 3 DMA request enable</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4DEN</name>
            <description>Capture/Compare 4 DMA request enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>COMDEN</name>
            <description>COM DMA request enable</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRGDEN</name>
            <description>Trigger DMA request enable</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>DMADDR</name>
        <displayName>DMADDR</displayName>
        <description>DMA address for full transfer</description>
        <addressOffset>0x4C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>DMADDR</name>
            <description>DMA register for burst accesses</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PSC</name>
        <displayName>PSC</displayName>
        <description>prescaler</description>
        <addressOffset>0x28</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PSC</name>
            <description>Prescaler value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>REPCNT</name>
        <displayName>REPCNT</displayName>
        <description>repetition counter register</description>
        <addressOffset>0x30</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>REPCNT</name>
            <description>Repetition counter value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SMCTRL</name>
        <displayName>SMCTRL</displayName>
        <description>slave mode control register</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SMFSEL</name>
            <description>Slave mode selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>TRGSEL</name>
            <description>Trigger selection</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        <field>
            <name>MSMEN</name>
            <description>Master/Slave mode</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ETFCFG</name>
            <description>External trigger filter</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ETPCFG</name>
            <description>External trigger prescaler</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>ECEN</name>
            <description>External clock enable</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ETPOL</name>
            <description>External trigger polarity</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>STS</name>
        <displayName>STS</displayName>
        <description>status register</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>UIFLG</name>
            <description>Update interrupt flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CC1IFLG</name>
            <description>Capture/compare 1 interrupt flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2IFLG</name>
            <description>Capture/Compare 2 interrupt flag</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3IFLG</name>
            <description>Capture/Compare 3 interrupt flag</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4IFLG</name>
            <description>Capture/Compare 4 interrupt flag</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>COMIFLG</name>
            <description>COM interrupt flag</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRGIFLG</name>
            <description>Trigger interrupt flag</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRKIFLG</name>
            <description>Break interrupt flag</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC1RCFLG</name>
            <description>Capture/Compare 1 overcapture flag</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2RCFLG</name>
            <description>Capture/compare 2 overcapture flag</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3RCFLG</name>
            <description>Capture/Compare 3 overcapture flag</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4RCFLG</name>
            <description>Capture/Compare 4 overcapture flag</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
