Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TMR9</name>
      <description>General purpose timers</description>
      <groupName>TMR</groupName>
      <baseAddress>0x40014000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>TMR1_BRK_TMR9</name>
        <description>TMR1 Break interrupt and TMR9 global interrupt</description>
        <value>24</value>
      </interrupt>
      <registers>
      <register>
        <name>AUTORLD</name>
        <displayName>AUTORLD</displayName>
        <description>auto-reload register</description>
        <addressOffset>0x2C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFFFF</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>AUTORLD</name>
            <description>Auto-reload value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CC1</name>
        <displayName>CC1</displayName>
        <description>capture/compare register 1</description>
        <addressOffset>0x34</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC1</name>
            <description>Capture/Compare 1 value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CC2</name>
        <displayName>CC2</displayName>
        <description>capture/compare register 2</description>
        <addressOffset>0x38</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC2</name>
            <description>Capture/Compare 2 value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCEN</name>
        <displayName>CCEN</displayName>
        <description>capture/compare enable register</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC1EN</name>
            <description>Capture/Compare 1 output enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC1POL</name>
            <description>Capture/Compare 1 output Polarity</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC1NPOL</name>
            <description>Capture/Compare 1 output Polarity</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2EN</name>
            <description>Capture/Compare 2 output enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2POL</name>
            <description>Capture/Compare 2 output Polarity</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CC2NPOL</name>
            <description>Capture/Compare 2 output Polarity</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CCM1_CAPTURE</name>
        <displayName>CCM1_CAPTURE</displayName>
        <description>capture/compare mode register 1 (input mode)</description>
        <alternateRegister>CCM1_COMPARE</alternateRegister>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC1SEL</name>
            <description>Capture/Compare 1 selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>IC1PSC</name>
            <description>Input capture 1 prescaler</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>IC1F</name>
            <description>Input capture 1 filter</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>CC2SEL</name>
            <description>Capture/Compare 2 selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>IC2PSC</name>
            <description>Input capture 2 prescaler</description>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        <field>
            <name>IC2F</name>
            <description>Input capture 2 filter</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CCM1_COMPARE</name>
        <displayName>CCM1_COMPARE</displayName>
        <description>capture/compare mode register 1 (output mode)</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CC1SEL</name>
            <description>Capture/Compare 1 selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OC1FEN</name>
            <description>Output Compare 1 fast enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC1PEN</name>
            <description>Output Compare 1 preload enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC1MOD</name>
            <description>Output Compare 1 mode</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>CC2SEL</name>
            <description>Capture/Compare 2 selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OC2FEN</name>
            <description>Output Compare 2 fast enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC2PEN</name>
            <description>Output Compare 2 preload enable</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>OC2MOD</name>
            <description>Output Compare 2 mode</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CEG</name>
        <displayName>CEG</displayName>
        <description>control event generation register</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>write-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>UEG</name>
            <description>Update generation</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CC1EG</name>
            <description>Capture/compare 1 generation</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2EG</name>
            <description>Capture/compare 2 generation</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TEG</name>
            <description>Trigger generation</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CNT</name>
        <displayName>CNT</displayName>
        <description>counter</description>
        <addressOffset>0x24</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CNT</name>
            <description>counter value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTRL1</name>
        <displayName>CTRL1</displayName>
        <description>control register 1</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CNTEN</name>
            <description>Counter enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UD</name>
            <description>Update disable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>URSSEL</name>
            <description>Update request source</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>SPMEN</name>
            <description>One-pulse mode</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ARPEN</name>
            <description>Auto-reload preload enable</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CLKDIV</name>
            <description>Clock division</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>DIEN</name>
        <displayName>DIEN</displayName>
        <description>DMA/Interrupt enable register</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>UIEN</name>
            <description>Update interrupt enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CC1IEN</name>
            <description>Capture/Compare 1 interrupt enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2IEN</name>
            <description>Capture/Compare 2 interrupt enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRGIEN</name>
            <description>Trigger interrupt enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>PSC</name>
        <displayName>PSC</displayName>
        <description>prescaler</description>
        <addressOffset>0x28</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PSC</name>
            <description>Prescaler value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SMCTRL</name>
        <displayName>SMCTRL</displayName>
        <description>slave mode control register</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>SMFSEL</name>
            <description>Slave mode selection</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>TRGSEL</name>
            <description>Trigger selection</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        <field>
            <name>MSMEN</name>
            <description>Master/Slave mode</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>STS</name>
        <displayName>STS</displayName>
        <description>status register</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>UIFLG</name>
            <description>Update interrupt flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        <field>
            <name>CC1IFLG</name>
            <description>Capture/compare 1 interrupt flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2IFLG</name>
            <description>Capture/Compare 2 interrupt flag</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRGIFLG</name>
            <description>Trigger interrupt flag</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC1RCFLG</name>
            <description>Capture/Compare 1 overcapture flag</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2RCFLG</name>
            <description>Capture/compare 2 overcapture flag</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
