Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WWDT</name>
      <description>Window watchdog</description>
      <groupName>WWDT</groupName>
      <baseAddress>0x40002C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>WWDG</name>
        <description>Window Watchdog interrupt</description>
        <value>0</value>
      </interrupt>
      <registers>
      <register>
        <name>CFG</name>
        <displayName>CFG</displayName>
        <description>Configuration register</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x7F</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>WIN</name>
            <description>7-bit window value</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
        <field>
            <name>TBPSC</name>
            <description>Timer Base Prescaler Factor Configure</description>
            <bitOffset>7</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EWIEN</name>
            <description>Early wakeup interrupt</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          </fields>
      </register>
      <register>
        <name>CTRL</name>
        <displayName>CTRL</displayName>
        <description>Control register</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x7F</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>CNT</name>
            <description>7-bit counter (MSB to LSB)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>WWDTEN</name>
            <description>Activation bit</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>STS</name>
        <displayName>STS</displayName>
        <description>Status register</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>EWIFLG</name>
            <description>Early wakeup interrupt flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SCB</name>
      <description>System Control Block</description>
      <groupName>SCB</groupName>
      <baseAddress>0xE000ED00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>s</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CPUID</name>
          <displayName>CPUID</displayName>
          <description>Provides identification information for the processor</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x410FC241</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REVISION</name>
              <description>Processor revision number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PARTNO</name>
              <description>Part number of the processor</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>ARCHITECTURE</name>
              <description>Indicates the architecture version</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Processor variant number</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>IMPLEMENTER</name>
              <description>Implementer identification</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSR</name>
          <displayName>ICSR</displayName>
          <description>Interrupt Control and State Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VECTACTIVE</name>
              <description>Active exception number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>RETTOBASE</name>
              <description>Indicates return to base level</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VECTPENDING</name>
              <description>Exception number of the pending interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>ISRPENDING</name>
              <description>Indicates if an interrupt is pending</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISRPREEMPT</name>
              <description>Indicates if a pending interrupt is preempting the current active interrupt</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PENDSTCLR</name>
              <description>Clear SysTick exception pending bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PENDSTSET</name>
              <description>Set SysTick exception pending bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PENDSVCLR</name>
              <description>Clear PendSV exception pending bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PENDSVSET</name>
              <description>Set PendSV exception pending bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NMIPENDSET</name>
              <description>NMI set-pending bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VTOR</name>
          <displayName>VTOR</displayName>
          <description>Vector Table Offset Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF80</resetMask>
          <fields>
            <field>
              <name>TBLOFF</name>
              <description>Vector table offset in memory</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
          </fields>
        </register>
      <register>
        <name>AIRCR</name>
        <displayName>AIRCR</displayName>
        <description>Application Interrupt and Reset Control Register</description>
        <addressOffset>0x00C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0xFA050000</resetValue>
        <resetMask>0xFFFF7FFF</resetMask>
        <fields>
          <field>
            <name>VECTRESET</name>
            <description>System Reset Request</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>VECTCLRACTIVE</name>
            <description>Clear all active state information for exceptions</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SYSRESETREQ</name>
            <description>Requests a system reset</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PRIGROUP</name>
            <description>Priority group field</description>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>ENDIANNESS</name>
            <description>Data endianness (0: little-endian, 1: big-endian)</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>VECTKEY</name>
            <description>Register writes must write 0x05FA to this field, otherwise the write is ignored.  On reads, returns 0xFA05.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SCR</name>
        <displayName>SCR</displayName>
        <description>System Control Register</description>
        <addressOffset>0x010</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0x00000007</resetMask>
        <fields>
          <field>
            <name>SLEEPONEXIT</name>
            <description>Indicates sleep-on-exit behavior</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SLEEPDEEP</name>
            <description>Controls deep sleep behavior</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SEVONPEND</name>
            <description>Send Event on Pending</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCR</name>
        <displayName>CCR</displayName>
        <description>Configuration and Control Register</description>
        <addressOffset>0x014</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0x00000200</resetValue>
        <resetMask>0x00003FFF</resetMask>
        <fields>
          <field>
            <name>NONBASETHRDENA</name>
            <description>Enable non-base thread mode</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>USERSETMPEND</name>
            <description>Allow user-level write to the Software Trigger Interrupt Register</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UNALIGN_TRP</name>
            <description>Enable trap for unaligned accesses</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DIV_0_TRP</name>
            <description>Enable trap for divide-by-zero</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BFHFNMIGN</name>
            <description>Ignore BusFault in NMI and HardFault handlers</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STKALIGN</name>
            <description>Indicates 8-byte stack alignment on exception entry</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DC</name>
            <description>Data cache enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IC</name>
            <description>Instruction cache enable</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BP</name>
            <description>Branch prediction enable</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SHPR1</name>
        <displayName>SHPR1</displayName>
        <description>System Handler Priority Register 1</description>
        <addressOffset>0x018</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PRI_4</name>
            <description>Priority of system handler 4 (Memory Management)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>PRI_5</name>
            <description>Priority of system handler 5 (Bus Fault)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>PRI_6</name>
            <description>Priority of system handler 6 (Usage Fault)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SHPR2</name>
        <displayName>SHPR2</displayName>
        <description>System Handler Priority Register 2</description>
        <addressOffset>0x01C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PRI_11</name>
            <description>Priority of system handler 11 (SVCall)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SHPR3</name>
        <displayName>SHPR3</displayName>
        <description>System Handler Priority Register 3</description>
        <addressOffset>0x020</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>PRI_12</name>
            <description>Priority of system handler 12 (Debug Monitor)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>PRI_14</name>
            <description>Priority of system handler 14 (PendSV)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>PRI_15</name>
            <description>Priority of system handler 15 (SysTick)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SHCSR</name>
        <displayName>SHCSR</displayName>
        <description>System Handler Control and State Register</description>
        <addressOffset>0x024</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0x0007FDFF</resetMask>
        <fields>
          <field>
            <name>MEMFAULTACT</name>
            <description>Indicates active state of the Memory Management Fault handler</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BUSFAULTACT</name>
            <description>Indicates active state of the Bus Fault handler</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>USGFAULTACT</name>
            <description>Indicates active state of the Usage Fault handler</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SVCALLACT</name>
            <description>Indicates active state of the SVCall handler</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MONITORACT</name>
            <description>Indicates active state of the Debug Monitor handler</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PENDSVACT</name>
            <description>Indicates active state of the PendSV handler</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SYSTICKACT</name>
            <description>Indicates active state of the SysTick handler</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>USGFAULTPENDED</name>
            <description>Indicates pending state of the Usage Fault handler</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MEMFAULTPENDED</name>
            <description>Indicates pending state of the Memory Management Fault handler</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BUSFAULTPENDED</name>
            <description>Indicates pending state of the Bus Fault handler</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SVCALLPENDED</name>
            <description>Indicates pending state of the SVCall handler</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MEMFAULTENA</name>
            <description>Enables the Memory Management Fault handler</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BUSFAULTENA</name>
            <description>Enables the Bus Fault handler</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>USGFAULTENA</name>
            <description>Enables the Usage Fault handler</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
