Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      <register>
        <name>CFSR</name>
        <displayName>CFSR</displayName>
        <description>Configurable Fault Status Register</description>
        <addressOffset>0x028</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <!-- MemManage Fields -->
          <field>
            <name>IACCVIOL</name>
            <description>Instruction access violation</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DACCVIOL</name>
            <description>Data access violation</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUNSTKERR</name>
            <description>Unstacking error during exception return</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MSTKERR</name>
            <description>Stacking error during exception entry</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MLSPERR</name>
            <description>Lazy state preservation error</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MMARVALID</name>
            <description>Indicates the MMAR holds a valid fault address</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- BusFault Fields -->
          <field>
            <name>IBUSERR</name>
            <description>Instruction bus error</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PRECISERR</name>
            <description>Precise data bus error</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IMPRECISERR</name>
            <description>Imprecise data bus error</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UNSTKERR</name>
            <description>Unstacking error during exception return</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STKERR</name>
            <description>Stacking error during exception entry</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LSPERR</name>
            <description>Lazy state preservation error</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BFARVALID</name>
            <description>Indicates the BFAR holds a valid fault address</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <!-- UsageFault Fields -->
          <field>
            <name>UNDEFINSTR</name>
            <description>Undefined instruction usage fault</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>INVSTATE</name>
            <description>Invalid state usage fault</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>INVPC</name>
            <description>Invalid program counter usage fault</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NOCP</name>
            <description>No coprocessor usage fault</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UNALIGNED</name>
            <description>Unaligned access usage fault</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DIVBYZERO</name>
            <description>Divide by zero usage fault</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HFSR</name>
        <displayName>HFSR</displayName>
        <description>HardFault Status Register</description>
        <addressOffset>0x02C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xC0000002</resetMask>
        <fields>
          <field>
            <name>VECTTBL</name>
            <description>Indicates a vector table read fault has occurred</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FORCED</name>
            <description>Indicates a forced HardFault has occurred</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DEBUGEVT</name>
            <description>Indicates a HardFault triggered by a debug event</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DFSR</name>
        <displayName>DFSR</displayName>
        <description>Debug Fault Status Register</description>
        <addressOffset>0x030</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0x0000001F</resetMask>
        <fields>
          <field>
            <name>HALTED</name>
            <description>Indicates a halt request debug event has occurred</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKPT</name>
            <description>Indicates a breakpoint debug event has occurred</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DWTTRAP</name>
            <description>Indicates a data watchpoint and trace (DWT) debug event has occurred</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>VCATCH</name>
            <description>Indicates a vector catch debug event has occurred</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EXTERNAL</name>
            <description>Indicates an external debug request has occurred</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MMFAR</name>
        <displayName>MMFAR</displayName>
        <description>Memory Management Fault Address Register</description>
        <addressOffset>0x034</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Fault address causing the memory management fault</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BFAR</name>
        <displayName>BFAR</displayName>
        <description>Bus Fault Address Register</description>
        <addressOffset>0x038</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Fault address causing the bus fault</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>AFSR</name>
        <displayName>AFSR</displayName>
        <description>Auxiliary Fault Status Register</description>
        <addressOffset>0x03C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>IMPDEF</name>
            <description>Implementation defined auxiliary fault status</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PFR0</name>
        <displayName>PFR0</displayName>
        <description>Processor Feature Register 0</description>
        <addressOffset>0x040</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>STATE0</name>
            <description>Indicates support for the Armv7-M architecture</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>STATE1</name>
            <description>Indicates support for the Armv6-M architecture</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>STATE2</name>
            <description>Reserved, must be zero</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>STATE3</name>
            <description>Reserved, must be zero</description>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>STATE4</name>
            <description>Reserved, must be zero</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PFR1</name>
        <displayName>PFR1</displayName>
        <description>Processor Feature Register 1</description>
        <addressOffset>0x044</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DFR</name>
        <displayName>DFR</displayName>
        <description>Debug Feature Register</description>
        <addressOffset>0x048</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>AFR</name>
        <displayName>AFR</displayName>
        <description>Auxiliary Feature Register</description>
        <addressOffset>0x04C</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MMFR0</name>
        <displayName>MMFR0</displayName>
        <description>Memory Model Feature Register 0</description>
        <addressOffset>0x050</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MMFR1</name>
        <displayName>MMFR1</displayName>
        <description>Memory Model Feature Register 1</description>
        <addressOffset>0x054</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MMFR2</name>
        <displayName>MMFR2</displayName>
        <description>Memory Model Feature Register 2</description>
        <addressOffset>0x058</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>MMFR3</name>
        <displayName>MMFR3</displayName>
        <description>Memory Model Feature Register 3</description>
        <addressOffset>0x05C</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISAR0</name>
        <displayName>ISAR0</displayName>
        <description>Instruction Set Attribute Register 0</description>
        <addressOffset>0x060</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISAR1</name>
        <displayName>ISAR1</displayName>
        <description>Instruction Set Attribute Register 1</description>
        <addressOffset>0x064</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISAR2</name>
        <displayName>ISAR2</displayName>
        <description>Instruction Set Attribute Register 2</description>
        <addressOffset>0x068</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISAR3</name>
        <displayName>ISAR3</displayName>
        <description>Instruction Set Attribute Register 3</description>
        <addressOffset>0x06C</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISAR4</name>
        <displayName>ISAR4</displayName>
        <description>Instruction Set Attribute Register 4</description>
        <addressOffset>0x070</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISAR5</name>
        <displayName>ISAR5</displayName>
        <description>Instruction Set Attribute Register 5</description>
        <addressOffset>0x074</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0xFFFFFFFF</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CPACR</name>
        <displayName>CPACR</displayName>
        <description>Coprocessor Access Control Register</description>
        <addressOffset>0x088</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <resetValue>0x00000000</resetValue>
        <resetMask>0x00F00000</resetMask>
        <fields>
          <field>
            <name>RESERVED</name>
            <description>Reserved, must be zero</description>
            <bitOffset>0</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
          <field>
            <name>CP10</name>
            <description>Access privileges for coprocessor 10 (floating-point unit)</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CP11</name>
            <description>Access privileges for coprocessor 11 (floating-point unit)</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>RESERVED2</name>
            <description>Reserved, must be zero</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
