Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ITM</name>
      <description>Instrumentation Trace Macrocell</description>
      <groupName>ITM</groupName>
      <baseAddress>0xE0000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>s</protection>
      </addressBlock>
      <registers>
        <register>
          <name>PORT%s</name>
          <description>ITM Stimulus Port Registers (aka ITM_STIMx)</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data written to the stimulus port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TER</name>
          <description>ITM Trace Enable Register (aka ITM_TERx)</description>
          <addressOffset>0xE00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLED</name>
              <description>Trace enable bits for each stimulus port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TPR</name>
          <description>ITM Trace Privilege Register</description>
          <addressOffset>0xE40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIVMASK</name>
              <description>Privilege mask for access control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR</name>
          <description>ITM Trace Control Register</description>
          <addressOffset>0xE80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITMENA</name>
              <description>ITM enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSENA</name>
              <description>Timestamp enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCENA</name>
              <description>Synchronization enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DWTENA</name>
              <description>DWT event enable (aka TXENA)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWOENA</name>
              <description>SWO output enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSPrescale</name>
              <description>Timestamp prescaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GTSFREQ</name>
              <description>Global timestamp frequency</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TraceBusID</name>
              <description>Trace bus ID</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>Indicates if ITM is busy</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LAR</name>
          <description>ITM Lock Access Register</description>
          <addressOffset>0xFB0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACCESS</name>
              <description>Write access to unlock ITM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LSR</name>
          <description>ITM Lock Status Register</description>
          <addressOffset>0xFB4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRESENT</name>
              <description>Indicates ITM presence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACCESS</name>
              <description>Indicates access status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BYTEACC</name>
              <description>Indicates byte access capability</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PID%s</name>
          <description>Peripheral Identification Registers</description>
          <addressOffset>0xFD0</addressOffset>
          <size>32</size>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral identification value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CID%s</name>
          <description>Component Identification Registers</description>
          <addressOffset>0xFF0</addressOffset>
          <size>32</size>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Component identification value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
