Embeetle/embeetle/beetle_core/mcuconfig/resources/series/APM32F411/old_files/APM32F411_original.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DWT</name>
      <description>Data Watchpoint and Trace</description>
      <groupName>DWT</groupName>
      <baseAddress>0xE0001000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
        <protection>s</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CYCCNTENA</name>
              <description>Enables cycle counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POSTPRESET</name>
              <description>Post-scaler preset value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>POSTINIT</name>
              <description>Post-initialization value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CYCTAP</name>
              <description>Cycle count tap</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCTAP</name>
              <description>Synchronization tap</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCSAMPLENA</name>
              <description>Enables program counter sampling</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXCTRCENA</name>
              <description>Enables exception tracing</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPIEVTENA</name>
              <description>Enables CPI counter event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXCEVTENA</name>
              <description>Enables exception overhead event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLEEPEVTENA</name>
              <description>Enables sleep event</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSUEVTENA</name>
              <description>Enables LSU counter event</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FOLDEVTENA</name>
              <description>Enables folded instruction event</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CYCEVTENA</name>
              <description>Enables cycle event</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOPRFCNT</name>
              <description>Indicates no profiling counters are implemented</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCYCCNT</name>
              <description>Indicates no cycle counter is implemented</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOEXTTRIG</name>
              <description>Indicates no external match trigger is implemented</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOTRCPKT</name>
              <description>Indicates no trace packets are implemented</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NUMCOMP</name>
              <description>Number of comparators implemented</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CYCCNT</name>
          <description>Cycle Count Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CYCCNT</name>
              <description>Cycle counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPICNT</name>
          <description>CPI Count Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>CPICNT</name>
              <description>CPI counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXCCNT</name>
          <description>Exception Overhead Count Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>EXCCNT</name>
              <description>Exception overhead counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEPCNT</name>
          <description>Sleep Count Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>SLEEPCNT</name>
              <description>Sleep counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LSUCNT</name>
          <description>LSU Count Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>LSUCNT</name>
              <description>LSU counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FOLDCNT</name>
          <description>Folded-instruction Count Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>FOLDCNT</name>
              <description>Folded-instruction counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSR</name>
          <description>Program Counter Sample Register</description>
          <addressOffset>0x01C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCSR</name>
              <description>Program counter sample value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP%s</name>
          <description>Comparator Registers</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMP</name>
              <description>Comparator value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK%s</name>
          <description>Mask Registers</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <access>read-write</access>
          <fields>
            <field>
              <name>MASK</name>
              <description>Mask value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNCTION%s</name>
          <description>Function Registers</description>
          <addressOffset>0x028</addressOffset>
          <size>32</size>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <access>read-write</access>
          <fields>
            <field>
              <name>FUNCTION</name>
              <description>Function settings</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
